{
    "id": 2,
    "title": "الواضح في أصول الفقه",
    "description": "الواضح في أصول الفقه للمبتدأين",
    "search": " بحث عن موضوع في كتاب الواضح ",
    "type": "المادة",
    "author": "د. محمد سليمان الأشقر",
    "publisher": "بشرح الشيخ أحمد نبيل شمس الدين",
    "section": "أصول فقه",
    "year": 1984,
    "audio_count": 36,
    "audio_type": "mp4",
    "sort": "id",
    "download": "https://archive.org/download/20210603_20210603_1739/%D8%A7%D9%84%D9%88%D8%A7%D8%B6%D8%AD%20%D9%81%D9%8A%20%D8%A3%D8%B5%D9%88%D9%84%20%D8%A7%D9%84%D9%81%D9%82%D9%87%20%D9%84%D9%84%D9%85%D8%A8%D8%AA%D8%AF%D8%A6%D9%8A%D9%86.pdf",
    "url": "https://www.youtube.com/embed",
    "image": "https://www.noor-book.com/publice/covers_cache_webp/1/f/5/e/8c612f6244f5e2dd1204cefc35d60b2c.jpg.webp",
    "data": [
        {
            "id": 1,
            "name": "الواضح في أصول الفقه للأشقر 1 ـ مقدمات ـ الشيخ أحمد نبيل",
            "url": "r2_CZRfrsqo"
        },
        {
            "id": 2,
            "name": "الواضح في أصول الفقه للأشقر 2 ـ تصنيف مباحث علم الأصول ـ الشيخ أحمد نبيل",
            "url": "yUBp4nZzuoA"
        },
        {
            "id": 3,
            "name": "الواضح في أصول الفقه للأشقر 3 ـ الحكم الشرعي والإيجاب ـ الشيخ أحمد نبيل",
            "url": "tTKDeMjlqJI"
        },
        {
            "id": 4,
            "name": "الواضح في أصول الفقه للأشقر 4 ـ التحريم والمستحب والمكروه ـ الشيخ أحمد نبيل",
            "url": "_cTX8a9h7g8"
        },
        {
            "id": 5,
            "name": "الواضح في أصول الفقه للأشقر 5 ـ الحكم الخامس الإباحة ـ الشيخ أحمد نبيل",
            "url": "aBQPzFGCGOg"
        },
        {
            "id": 6,
            "name": "الواضح في أصول الفقه للأشقر 6 ـ قواعد المباح ـ الشيخ أحمد نبيل",
            "url": "jg6G4sHjdYg"
        },
        {
            "id": 7,
            "name": "الواضح في أصول الفقه للأشقر 7 ـ المانع ـ الشيخ أحمد نبيل",
            "url": "H5eGaedrROI"
        },
        {
            "id": 8,
            "name": "الواضح في أصول الفقه للأشقر 8 ـ المحكوم عليه ـ الشيخ أحمد نبيل",
            "url": "ZD6TwmXwUYE"
        },
        {
            "id": 9,
            "name": "الواضح في أصول الفقه للأشقر 9 ـ استكمال باب المحكوم عليه وباب المحكوم فيه ـ الشيخ أحمد نبيل",
            "url": "rUbpMxIulGE"
        },
        {
            "id": 10,
            "name": "الواضح في أصول الفقه للأشقر 10 ـ القرآن ـ الشيخ أحمد نبيل",
            "url": "qoq1wRep200"
        },
        {
            "id": 11,
            "name": "الواضح في أصول الفقه للأشقر 11 ـ المحكم والمتشابه والنسخ ـ الشيخ أحمد نبيل",
            "url": "CYBcJlKE--w"
        },
        {
            "id": 12,
            "name": "الواضح في أصول الفقه للأشقر 12 ـ الباب الثاني السنة النبوية ـ الشيخ أحمد نبيل",
            "url": "jeDiAtBvmKI"
        },
        {
            "id": 13,
            "name": "الواضح في أصول الفقه للأشقر 13 ـ ما هو حجة من الأفعال والأقوال ـ الشيخ أحمد نبيل",
            "url": "m4_as1Rplpo"
        },
        {
            "id": 14,
            "name": "الواضح في أصول الفقه للأشقر 14 ـ أنواع نقل السنة بالنسبة إلينا ـ الشيخ أحمد نبيل",
            "url": "yg213cA2tHQ"
        },
        {
            "id": 15,
            "name": "الواضح في أصول الفقه للأشقر 15 ـ الاحتجاج بأخبار الآحاد في العقائد ـ الشيخ أحمد نبيل",
            "url": "ArlO1EiYphE"
        },
        {
            "id": 16,
            "name": "الواضح في أصول الفقه للأشقر 16 ـ الإجماع ـ الشيخ أحمد نبيل",
            "url": "uvf_niZTaQ4"
        },
        {
            "id": 17,
            "name": "الواضح في أصول الفقه للأشقر 17 ـ قول الصحابي وإجماع أهل المدينة ـ الشيخ أحمد نبيل",
            "url": "dW3mUUvETo8"
        },
        {
            "id": 18,
            "name": "الواضح في أصول الفقه للأشقر 18 ـ شرع من قبلنا والاستحسان ـ الشيخ أحمد نبيل",
            "url": "k76-cCMR39M"
        },
        {
            "id": 19,
            "name": "الواضح في أصول الفقه للأشقر 19 ـ المصلحة المرسلة والعرف ـ الشيخ أحمد نبيل",
            "url": "90pWsutkXro"
        },
        {
            "id": 20,
            "name": "الواضح في أصول الفقه للأشقر 20 ـ سد الذرائع والاستقراء والاستدلال والاستصحاب ـ الشيخ أحمد نبيل",
            "url": "Yi9f89i8cJo"
        },
        {
            "id": 21,
            "name": "الواضح في أصول الفقه للأشقر 21 ـ بداية القسم الثالث المجمل والمبين ـ الشيخ أحمد نبيل",
            "url": "Re90QtVorOU"
        },
        {
            "id": 22,
            "name": "الواضح في أصول الفقه للأشقر 22 ـ الظاهر والموؤل ـ الشيخ أحمد نبيل",
            "url": "QuaIRRzgiu8"
        },
        {
            "id": 23,
            "name": "الواضح في أصول الفقه للأشقر 23 ـ العام والخاص ـ الشيخ أحمد نبيل",
            "url": "qy53pi78K_8"
        },
        {
            "id": 24,
            "name": "الواضح في أصول الفقه للأشقر 24 ـ العموم المعنوي ـ الشيخ أحمد نبيل",
            "url": "wTPQ98kxid4"
        },
        {
            "id": 25,
            "name": "الواضح في أصول الفقه للأشقر 25 ـ المخصصات المنفصلة والفرق بين النسخ والتخصيص والمشترك ـ",
            "url": "MMy5uQsUCKE"
        },
        {
            "id": 26,
            "name": "الواضح في أصول الفقه للأشقر 26 ـ المطلق والمقيد وحل تمارين العام والخاص والمطلق والمقيد ـ الشيخ أحمد",
            "url": "45pYw8boEG0"
        },
        {
            "id": 27,
            "name": "الواضح في أصول الفقه للأشقر 27 ـ الأمر ـ الشيخ أحمد نبيل",
            "url": "ZkHukm7ZvBs"
        },
        {
            "id": 28,
            "name": "الواضح في أصول الفقه للأشقر 28 ـ النهي ودلالة الاقتضاء والإشارة والإيماء ـ الشيخ أحمد نبيل",
            "url": "MZZhdawx8mA"
        },
        {
            "id": 29,
            "name": "الواضح في أصول الفقه للأشقر 29 ـ مفهوم الموافقة ومفهوم المخالفة ـ الشيخ أحمد نبيل",
            "url": "UGjdjEct6Gc"
        },
        {
            "id": 30,
            "name": "الواضح في أصول الفقه للأشقر 30 ـ القياس وحجيته وأركانه وشرائط صحته ـ الشيخ أحمد نبيل",
            "url": "1pDvapY_BHs"
        },
        {
            "id": 31,
            "name": "الواضح في أصول الفقه للأشقر 31 ـ مسالك العلة وما لا يقاس عليه ـ الشيخ أحمد نبيل",
            "url": "GhxEK3bkWYQ"
        },
        {
            "id": 32,
            "name": "الواضح في أصول الفقه للأشقر 32 ـ الاجتهاد ـ الشيخ أحمد نبيل",
            "url": "VR0Nl5ragSs"
        },
        {
            "id": 33,
            "name": "الواضح في أصول الفقه للأشقر 33 ـ الطريق العملي للوصول إلى الحُكم الشَّرعي ـ الشيخ أحمد نبيل",
            "url": "EGbtM0mXfkU"
        },
        {
            "id": 34,
            "name": "الواضح في أصول الفقه للأشقر 34 ـ طرق دفع التعارض الظاهري بين الأدلة الشرعية ـ الشيخ أحمد نبيل",
            "url": "r8KZLPOBmFE"
        },
        {
            "id": 35,
            "name": "الواضح في أصول الفقه للأشقر 35 ـ الفُتْيا والتقليد ـ الشيخ أحمد نبيل",
            "url": "qdK6tKLIRWM"
        },
        {
            "id": 36,
            "name": "الواضح في أصول الفقه للأشقر 36 والأخيرة ـ باب تطبيقي على قواعد أصول الفقه ـ الشيخ أحمد نبيل",
            "url": "Nuwq1LAj6Uo"
        }
    ]
}