/** @type {import('next-sitemap').IConfig} */

const quraanSuras = [
  "الفاتحة", "البقرة", "آل عمران", "النساء", "المائدة", "الأنعام", "الأعراف", "الأنفال",
  "التوبة", "يونس", "هود", "يوسف", "الرعد", "إبراهيم", "الحجر", "النحل", "الإسراء", "الكهف",
  "مريم", "طه", "الأنبياء", "الحج", "المؤمنون", "النور", "الفرقان", "الشعراء", "النمل", "القصص",
  "العنكبوت", "الروم", "لقمان", "السجدة", "الأحزاب", "سبأ", "فاطر", "يس", "الصافات", "ص", "الزمر",
  "غافر", "فصلت", "الشورى", "الزخرف", "الدخان", "الجاثية", "الأحقاف", "محمد", "الفتح", "الحجرات",
  "ق", "الذاريات", "الطور", "النجم", "القمر", "الرحمن", "الواقعة", "الحديد", "المجادلة", "الحشر",
  "الممتحنة", "الصف", "الجمعة", "المنافقون", "التغابن", "الطلاق", "التحريم", "الملك", "القلم",
  "الحاقة", "المعارج", "نوح", "الجن", "المزمل", "المدثر", "القيامة", "الإنسان", "المرسلات",
  "النبأ", "النازعات", "عبس", "التكوير", "الانفطار", "المطففين", "الانشقاق", "البروج", "الطارق",
  "الأعلى", "الغاشية", "الفجر", "البلد", "الشمس", "الليل", "الضحى", "الشرح", "التين", "العلق",
  "القدر", "البينة", "الزلزلة", "العاديات", "القارعة", "التكاثر", "العصر", "الهمزة", "الفيل",
  "قريش", "الماعون", "الكوثر", "الكافرون", "النصر", "المسد", "الإخلاص", "الفلق", "الناس"
];

const quraanQaree = [
  "المنشاوي - مرتل",
  "المنشاوي-المعلم",
  "الحصري - مرتل",
  "الحصري-الإذاعة",
  "عبدالباسط - مرتل",
  "محمود علي البنا",
  "مصطفى إسماعيل",
  "أحمد نعينع",
  "محمد محمود الطبلاوي",
  "سعد الغامدي",
  "ناصر القطامي",
  "ياسر الدوسري",
  "ماهر المعيقلي",
  "فارس عبّاد",
  "مشاري راشد",
  "محمد أيوب",
  "محمد جبريل",
  "سعود الشريم",
  "عبدالرحمن السديسي",
  "الحذيفي",
  "أبوبكر الشاطري",
  "عبدالمحسن القاسم",
  "أحمد العجمي",
  "ياسر سلامة",
  "صلاح الهاشم",
  "أكرم العلاقمي",
  "هاني الرفاعي",
  "علي حجاج السويسى",
  "إبراهيم الأخضر",
  "خليفة الطنيجي",
  "عبدالله المطرود",
  "محمد عبدالكريم",
  "شهريار بهريز",
  "المنشاوي - مجود",
  "الحصري - مجود",
  "عبدالباسط - مجود",
  "عبدالله بصفر-مجود",
  "الحصري-ورش",
  "عبدالباسط -ورش",
  "سهل ياسين-ورش",
  "الجزائري - ورش",
  "إبراهيم الدوسري-ورش",
  "الحصري - قالون",
  "الحذيفي-قالون",
  "أحمد خضر الطرابلسي",
  "الحذيفي-شعبة",
  "فؤاد الخامري -شعبة",
  "عبدالحكيم عبداللطيف -شعبة",
  "عبدالرشيد صوفي-السوسي",
  "مفتاح السلطني -الدوري"
];

const radios = [
"إذاعة صور من حياة الصحابة رضوان الله عليهم",
"تراتيل قصيرة متميزة",
"إذاعة آيات السكينة",
"إذاعة القرآن الكريم من القاهرة",
"إذاعة القرآن الكريم من المملكة العربية السعودية",
"إذاعة الحرم المكي",
"إذاعة فتاوى الشيخ ابن عثيمين",
"إذاعة فتاوى الشيخ متولي الشعراوي",
"إذاعة نداء الإسلام",
"تفسير القرآن الكريم",
"سورة البقرة  لعدد من الحفص عن عاصم",
"الإذاعة العامة - اذاعة متنوعة لمختلف الحفص عن عاصم",
"تلاوات خاشعة",
"أحمد الحواشي",
"أحمد الطرابلسي",
"أحمد الطرابلسي  رواية قالون عن نافع",
"أحمد بن علي العجمي",
"أحمد خليل شاهين",
"أحمد ديبان",
"أحمد صابر",
"أحمد عامر",
"أحمد نعينع",
"أذكار الصباح",
"أذكار المساء",
"أكرم العلاقمي",
"إبراهيم الأخضر",
"إدريس أبكر",
"ابراهيم الدوسري  رواية ورش عن نافع",
"الدوكالي محمد العالم  رواية قالون عن نافع",
"الرقية الشرعية",
"الزين محمد أحمد",
"العيون الكوشي  رواية ورش عن نافع",
"الفاتح محمد الزبير رواية الدوري عن أبي عمرو",
"الفتاوى",
"القارئ ياسين رواية ورش عن نافع",
"المختصر في السيرة النبوية  حلقات مختصرة عن سيرة نبيّنا محمد صلى الله عليه وسلم",
"المختصر في تفسير القرآن الكريم",
"بندر بليله",
"ترجمة معاني القرآن الكريم باللغة الأوردية  القارئ عبدالباسط عبدالصمد",
"ترجمة معاني القرآن باللغة الأسبانية",
"ترجمة معاني القرآن باللغة الألبانية",
"ترجمة معاني القرآن باللغة الألمانية",
"ترجمة معاني القرآن باللغة الأمازيغية",
"ترجمة معاني القرآن باللغة الأوردية  القارئ عبدالرحمن السديس و سعود الشريم",
"ترجمة معاني القرآن باللغة الأوردية  القارئ محمد المنشاوي",
"ترجمة معاني القرآن باللغة الإنجليزية   القارئ عبدالباسط عبدالصمد",
"ترجمة معاني القرآن باللغة الإنجليزية   القارئ عبدالله صفر",
"ترجمة معاني القرآن باللغة الإنجليزية  ترجمة والك-  القارئ عبدالباسط عبدالصمد",
"ترجمة معاني القرآن باللغة البرتغالية",
"ترجمة معاني القرآن باللغة البوسنية",
"ترجمة معاني القرآن باللغة التركية",
"ترجمة معاني القرآن باللغة الصينية",
"ترجمة معاني القرآن باللغة الفارسية",
"ترجمة معاني القرآن باللغة الفرنسية",
"ترجمة معاني القرآن باللغة الكردية",
"ترجمة معاني القرآن باللغة المجرية",
"ترجمة معاني القرآن باللغة اليونانية",
"تكبيرات العيد",
"توفيق الصايغ",
"جمال شاكر عبدالله",
"جمعان العصيمي",
"حاتم فريد الواعر",
"خالد الجليل",
"خالد القحطاني",
"خالد المهنا",
"خالد عبدالكافي",
"خليفة الطنيجي",
"زكي داغستاني",
"سعد الغامدي",
"سعود الشريم",
"سهل ياسين",
"سيد رمضان",
"شيخ أبو بكر الشاطري",
"شيرزاد عبدالرحمن طاهر",
"صابر عبدالحكم",
"صلاح البدير",
"صلاح الهاشم",
"صلاح بو خاطر",
"طارق دعوب  رواية قالون عن نافع",
"عادل الكلباني",
"عادل ريان",
"عبدالبارئ الثبيتي",
"عبدالبارئ محمد",
"عبدالباسط عبدالصمد ",
"عبدالباسط عبدالصمد  مجود",
"عبدالباسط عبدالصمد  رواية ورش عن نافع",
"عبدالرحمن السديس",
"عبدالرحمن الماجد",
"عبدالرشيد صوفي  رواية السوسي عن أبي عمرو",
"عبدالرشيد صوفي  رواية خلف عن حمزة",
"عبدالعزيز الأحمد",
"عبدالله الخلف",
"عبدالله الكندري",
"عبدالله المطرود",
"عبدالله الموسى",
"عبدالله بصفر",
"عبدالله خياط",
"عبدالله عواد الجهني",
"عبدالمحسن الحارثي",
"عبدالمحسن العبيكان",
"عبدالمحسن القاسم",
"عبدالهادي أحمد كناكري",
"عبدالودود حنيف",
"علي الحذيفي",
"علي جابر",
"علي حجاج السويسي",
"عماد زهير حافظ",
"عمر القزابري  رواية ورش عن نافع",
"فارس عباد",
"في ظلال السيرة النبوية  400 حلقة عن سيرة نبينا محمد صلى الله عليه وسلم",
"كتاب الاختيارات الفقهية في مسائل العبادات والمعاملات من فتاوى الشيخ الإمام ابن باز رحمه لله",
"ماجد الزامل",
"ماهر المعيقلي",
"ماهر شخاشيرو",
"1 محمد أيوب",
"2 محمد أيوب",
"محمد الطبلاوي",
"محمد اللحيدان",
"محمد جبريل",
"محمد رشاد الشريف",
"محمد صالح عالم شاه",
"محمد صديق المنشاوي",
"محمد صديق المنشاوي  مجود",
"محمد عبدالحكيم العبدالله  رواية البزي وقنبل عن ابن كثير",
"محمد عبدالحكيم العبدالله  رواية الدوري عن الكسائي",
"محمد عبدالكريم",
"محمد عبدالكريم  رواية ورش عن نافع من طريق أبي بكر الأصبهاني",
"محمد عثمان خان ( من الهند )",
"محمود الرفاعي",
"محمود الشيمي  رواية الدوري عن الكسائي",
"محمود خليل الحصري",
"محمود خليل الحصري  مجود",
"محمود خليل الحصري  رواية ورش عن نافع",
"محمود علي البنا",
"محمود علي البنا  مجود",
"مشاري العفاسي",
"مصطفى إسماعيل",
"مصطفى اللاهوني",
"مصطفى رعد العزاوي",
"معيض الحارثي",
"مفتاح السلطني",
"مفتاح السلطني  رواية ابن ذكوان عن ابن عامر",
"مفتاح السلطني  رواية الدوري عن أبي عمرو",
"مفتاح السلطني  رواية الدوري عن الكسائي",
"موسى بلال",
"ناصر العصفور",
"ناصر القطامي",
"ناصر الماجد",
"نبيل الرفاعي",
"نعمة الحسان",
"هاني الرفاعي",
"هيثم الجدعاني",
"وليد النائحي  رواية قالون عن نافع من طريق أبي نشيط",
"ياسر الدوسري",
"ياسر القرشي",
"ياسر المزروعي  حفص عن عاصمة يعقوب الحضرمي بروايتي رويس وروح ",
"يحيى حوا",
"يوسف الشويعي",
"يوسف بن نوح أحمد",
"شهر رمضان المبارك",
"ستة من شوال",
"يوم عاشوراء",
"سورة الملك",
"تفسير القرآن الكريم - الخلاصة من تفسير الطبري",
"عشر ذي الحجة",
    ];

const khotap = {
    "مكتبة الشيخ الحويني": [
        {
            "title": "كل محاضرات الشيخ الحويني رحمه الله",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 3952,
            "audio_type": "mp4"
        },
        {
            "title": "أبو بكر الصديق رضي الله عنه",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 19,
            "audio_type": "mp4"
        },
        {
            "title": "أبيات شعر رائعة",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 30,
            "audio_type": "mp4"
        },
        {
            "title": "أحاديث ضعيفة وموضوعة عن النبي ﷺ",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 89,
            "audio_type": "mp4"
        },
        {
            "title": "أحاديث ضعيفة",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 46,
            "audio_type": "mp4"
        },
        {
            "title": "أحكام صفة صلاة النبي ﷺ كأنك تراه",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 13,
            "audio_type": "mp4"
        },
        {
            "title": "أولئك أبائي برنامج إذاعي الموسم الثاني 2019/1440",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 29,
            "audio_type": "mp4"
        },
        {
            "title": "أولئك أبائي برنامج الإذاعي الموسم الاول عام 2018/1439",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 32,
            "audio_type": "mp4"
        },
        {
            "title": "الأحداث الجارية",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 120,
            "audio_type": "mp4"
        },
        {
            "title": "البرنامج الإذاعي أندى العالمين رمضان 1442",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 10,
            "audio_type": "mp4"
        },
        {
            "title": "الدروس المستفادة من صحيح السيرة النبوية",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 36,
            "audio_type": "mp4"
        },
        {
            "title": "الدفاع عن أبو هريرة رضي الله عنه",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 15,
            "audio_type": "mp4"
        },
        {
            "title": "الدفاع عن النبي ﷺ",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 136,
            "audio_type": "mp4"
        },
        {
            "title": "الدفاع عن مصدرنا الأصلية البخاري ومسلم",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 48,
            "audio_type": "mp4"
        },
        {
            "title": "الرحمة بالحيوانات",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 2,
            "audio_type": "mp4"
        },
        {
            "title": "الزكاة فى حياة المسلم",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 10,
            "audio_type": "mp4"
        },
        {
            "title": "السيرة من حياة أبو بكر الصديق رضي الله عنه",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 6,
            "audio_type": "mp4"
        },
        {
            "title": "السيرة من حياة سيدنا علي بن أبي طالب رضي الله عنه",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 1,
            "audio_type": "mp4"
        },
        {
            "title": "الشيخ أبو نعيم المغربي رحمه الله",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 3,
            "audio_type": "mp4"
        },
        {
            "title": "الشيخ سعيد عبدالعظيم رحمه الله",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 2,
            "audio_type": "mp4"
        },
        {
            "title": "الشيخ عبدالرحمن عبدالخالق في ضيافة الشيخ الحويني",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 5,
            "audio_type": "mp4"
        },
        {
            "title": "الصارم المسلول على شاتم الرسول",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 13,
            "audio_type": "mp4"
        },
        {
            "title": "المنبر الصوتي",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 148,
            "audio_type": "mp4"
        },
        {
            "title": "برنامج أندى العالمين 1439/2018",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 31,
            "audio_type": "mp4"
        },
        {
            "title": "برنامج أندى العالمين 2013/1434",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 26,
            "audio_type": "mp4"
        },
        {
            "title": "برنامج أولئك أبائي 2008",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 8,
            "audio_type": "mp4"
        },
        {
            "title": "برنامج الخيمة الرمضانية",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 7,
            "audio_type": "mp4"
        },
        {
            "title": "برنامج بصائر | للشيخ الحويني",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 8,
            "audio_type": "mp4"
        },
        {
            "title": "برنامج زاد الغريب 2016/1437",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 26,
            "audio_type": "mp4"
        },
        {
            "title": "برنامج ساعة وساعة",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 21,
            "audio_type": "mp4"
        },
        {
            "title": "برنامج سبيل التائبين 1442",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 30,
            "audio_type": "mp4"
        },
        {
            "title": "برنامج سفينة حياة ترجمة الشيخ الحويني| رمضان 1441",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 32,
            "audio_type": "mp4"
        },
        {
            "title": "برنامج ضفاف الكوثر",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 19,
            "audio_type": "mp4"
        },
        {
            "title": "برنامج عابر سبيل 2015/1436",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 31,
            "audio_type": "mp4"
        },
        {
            "title": "برنامج فك الوثاق من شرح صحيح البخاري",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 82,
            "audio_type": "mp4"
        },
        {
            "title": "برنامج وبالحق نزل 1440/2019",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 26,
            "audio_type": "mp4"
        },
        {
            "title": "برنامج وبالحق نزل 2017 / 1438",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 32,
            "audio_type": "mp4"
        },
        {
            "title": "تجارب الزمان",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 48,
            "audio_type": "mp4"
        },
        {
            "title": "ترجمة  الإمام الشافعي رضي الله عنه",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 9,
            "audio_type": "mp4"
        },
        {
            "title": "ترجمة الإمام سفيان الثوري رحمه الله",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 7,
            "audio_type": "mp4"
        },
        {
            "title": "ترجمة الإمام سلمان بن مهران الأعمش",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 6,
            "audio_type": "mp4"
        },
        {
            "title": "ترجمة الإمام مالك رحمة ﷲ",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 6,
            "audio_type": "mp4"
        },
        {
            "title": "ترجمة الشيخ عبدالرحمن عبدالخالق رحمه الله",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 24,
            "audio_type": "mp4"
        },
        {
            "title": "ترجمة عبدالله بن عمر رضي الله عنهما",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 6,
            "audio_type": "mp4"
        },
        {
            "title": "تلاوات نادرة للشيخ الحويني",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 35,
            "audio_type": "mp4"
        },
        {
            "title": "تنبيهات",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 884,
            "audio_type": "mp4"
        },
        {
            "title": "جولة فى مكتبة الشيخ",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 40,
            "audio_type": "mp4"
        },
        {
            "title": "حرس الحدود",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 56,
            "audio_type": "mp4"
        },
        {
            "title": "حلم النبي ﷺ مع غدر اليهود",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 20,
            "audio_type": "mp4"
        },
        {
            "title": "خطب المحبة لله ورسوله",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 3,
            "audio_type": "mp4"
        },
        {
            "title": "خطب صوتية",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 163,
            "audio_type": "mp4"
        },
        {
            "title": "خطب مرئية",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 121,
            "audio_type": "mp4"
        },
        {
            "title": "خواطر رمضانية 1443",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 25,
            "audio_type": "mp4"
        },
        {
            "title": "درر الحويني",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 94,
            "audio_type": "mp4"
        },
        {
            "title": "ذكريات مع الإمام محمد ناصر السنة الألباني",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 28,
            "audio_type": "mp4"
        },
        {
            "title": "ذكريات من زمن فات",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 29,
            "audio_type": "mp4"
        },
        {
            "title": "رثاء العلماء",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 25,
            "audio_type": "mp4"
        },
        {
            "title": "رحلتي إلي أوروبا",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 8,
            "audio_type": "mp4"
        },
        {
            "title": "رسائل من القلب",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 119,
            "audio_type": "mp4"
        },
        {
            "title": "زفرات مهموم وأنات مكلوم",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 17,
            "audio_type": "mp4"
        },
        {
            "title": "زهرة الفردوس 2016",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 5,
            "audio_type": "mp4"
        },
        {
            "title": "سلسة القدوة الحسنة",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 2,
            "audio_type": "mp4"
        },
        {
            "title": "سلسلة | المحبة",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 24,
            "audio_type": "mp4"
        },
        {
            "title": "سلسلة التابع والمتبوع",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 2,
            "audio_type": "mp4"
        },
        {
            "title": "سلسلة برنامج النبلاء",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 27,
            "audio_type": "mp4"
        },
        {
            "title": "سلسلة برنامج منتدى الحكمة",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 8,
            "audio_type": "mp4"
        },
        {
            "title": "سلسلة تحت راية السنة",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 10,
            "audio_type": "mp4"
        },
        {
            "title": "سلسلة حديث حادثة الافك",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 23,
            "audio_type": "mp4"
        },
        {
            "title": "سلسلة حديث مقتل عمر بن الخطاب",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 8,
            "audio_type": "mp4"
        },
        {
            "title": "سلسلة حديث هرقل",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 1,
            "audio_type": "mp4"
        },
        {
            "title": "سلسلة حق النبي ﷺ علي أمتة",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 12,
            "audio_type": "mp4"
        },
        {
            "title": "سلسلة حياة الصحابة ١٤٤٤/٢٠٢٣",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 8,
            "audio_type": "mp4"
        },
        {
            "title": "سلسلة زهرة الفردوس",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 34,
            "audio_type": "mp4"
        },
        {
            "title": "سلسلة شرح الباعث الحثيث",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 11,
            "audio_type": "mp4"
        },
        {
            "title": "سلسلة شرح النفيس لاختصار علوم الحديث",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 20,
            "audio_type": "mp4"
        },
        {
            "title": "سلسلة شرح حديث الوصايا الخمس",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 2,
            "audio_type": "mp4"
        },
        {
            "title": "سلسلة شرح كتاب العلم من كتاب صحيح البخاري",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 24,
            "audio_type": "mp4"
        },
        {
            "title": "سلسلة شرح كتاب بلوغ المرام",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 7,
            "audio_type": "mp4"
        },
        {
            "title": "سلسلة شمائل النبي ﷺ كأنك تراه",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 12,
            "audio_type": "mp4"
        },
        {
            "title": "سلسلة عطر الكلام",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 21,
            "audio_type": "mp4"
        },
        {
            "title": "سلسلة فضائل الصحابة",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 13,
            "audio_type": "mp4"
        },
        {
            "title": "سلسلة قصة داوود وسليمان عليهما السلام",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 7,
            "audio_type": "mp4"
        },
        {
            "title": "سلسلة قصة قارون",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 5,
            "audio_type": "mp4"
        },
        {
            "title": "سلسلة محاضرة مفاتيح السعادة الزوجية",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 35,
            "audio_type": "mp4"
        },
        {
            "title": "سلسلة مدرسة الحياة 1428 هـ",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 31,
            "audio_type": "mp4"
        },
        {
            "title": "سلسلة مدرسة الحياة 1430 هـ",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 30,
            "audio_type": "mp4"
        },
        {
            "title": "سلسلة مقاطع للشيخ أسامة عبدالعظيم رحمه لله",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 8,
            "audio_type": "mp4"
        },
        {
            "title": "سلسلة من قصص التائبين",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 6,
            "audio_type": "mp4"
        },
        {
            "title": "سلسلة واعلموا ان فيكم رسول الله",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 20,
            "audio_type": "mp4"
        },
        {
            "title": "سلسلة وقال المحدث",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 10,
            "audio_type": "mp4"
        },
        {
            "title": "سلسلة| الحسبة الأمر بالمعروف والنهي عن المنكر",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 6,
            "audio_type": "mp4"
        },
        {
            "title": "سلسلة| قصة الحج",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 10,
            "audio_type": "mp4"
        },
        {
            "title": "سيرة أم المؤمنين عائشة رضي الله عنها",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 16,
            "audio_type": "mp4"
        },
        {
            "title": "شرح ألفية السيوطي",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 11,
            "audio_type": "mp4"
        },
        {
            "title": "شرح الأربعين النووية 2021/1443",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 2,
            "audio_type": "mp4"
        },
        {
            "title": "شرح سلسلة ألفية السيوطي",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 17,
            "audio_type": "mp4"
        },
        {
            "title": "شرح كتاب الرِقاق | صحيح البخاري 1441 /2020",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 28,
            "audio_type": "mp4"
        },
        {
            "title": "شهر رمضان",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 37,
            "audio_type": "mp4"
        },
        {
            "title": "صفة صلاة النبي ﷺ كأنك تراه",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 14,
            "audio_type": "mp4"
        },
        {
            "title": "عظمة كلمة «لَا إِلَٰهَ إِلَّا ٱللَّٰهُ»",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 33,
            "audio_type": "mp4"
        },
        {
            "title": "عمرو بن العاص رضي الله عنه",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 7,
            "audio_type": "mp4"
        },
        {
            "title": "غزة لن تنكسر",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 41,
            "audio_type": "mp4"
        },
        {
            "title": "فتاوى الحويني",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 558,
            "audio_type": "mp4"
        },
        {
            "title": "فتاوي حديثية",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 116,
            "audio_type": "mp4"
        },
        {
            "title": "فضائل يوم عرفة",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 3,
            "audio_type": "mp4"
        },
        {
            "title": "فضفضة",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 337,
            "audio_type": "mp4"
        },
        {
            "title": "فوائد المحاضرة الشهيرة حديث أم ذرع",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 15,
            "audio_type": "mp4"
        },
        {
            "title": "فوائد من حديث تخلف كعب بن مالك عن غزوة تبوك",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 13,
            "audio_type": "mp4"
        },
        {
            "title": "في رحاب آية",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 31,
            "audio_type": "mp4"
        },
        {
            "title": "قال رَسُولَ اللَّهِ ﷺ",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 44,
            "audio_type": "mp4"
        },
        {
            "title": "قصة إسلام شباب أوروبا",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 8,
            "audio_type": "mp4"
        },
        {
            "title": "قصص من حياة الخلفاء الراشدين",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 1,
            "audio_type": "mp4"
        },
        {
            "title": "قصص من حياة الصحابة والتابعين",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 31,
            "audio_type": "mp4"
        },
        {
            "title": "قصص وحكايات",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 396,
            "audio_type": "mp4"
        },
        {
            "title": "قطوف  منبرية",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 23,
            "audio_type": "mp4"
        },
        {
            "title": "قطوف | الأسرة المسلمة",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 87,
            "audio_type": "mp4"
        },
        {
            "title": "قطوف | الروافض",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 32,
            "audio_type": "mp4"
        },
        {
            "title": "قطوف | الصلاة",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 62,
            "audio_type": "mp4"
        },
        {
            "title": "قطوف | العبادات والطاعات",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 95,
            "audio_type": "mp4"
        },
        {
            "title": "قطوف | بسمة",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 38,
            "audio_type": "mp4"
        },
        {
            "title": "قطوف | تربية النفس",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 221,
            "audio_type": "mp4"
        },
        {
            "title": "قطوف | رد وتعليق",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 157,
            "audio_type": "mp4"
        },
        {
            "title": "قطوف | رقائق ومواعظ",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 256,
            "audio_type": "mp4"
        },
        {
            "title": "قطوف | علم الحديث",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 134,
            "audio_type": "mp4"
        },
        {
            "title": "قطوف مرئية",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 367,
            "audio_type": "mp4"
        },
        {
            "title": "كرامات الصوفية",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 9,
            "audio_type": "mp4"
        },
        {
            "title": "كلام في الأولياء | مدرسة الحياة 1432 هـ",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 14,
            "audio_type": "mp4"
        },
        {
            "title": "كلمة الشيخ في زفاف",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 16,
            "audio_type": "mp4"
        },
        {
            "title": "لقاء الشيخ الحويني فى ضيافة الشيخ الدكتور أحمد النقيب",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 5,
            "audio_type": "mp4"
        },
        {
            "title": "لقاء الشيخ الحويني في ضيافة الشيخ محمد حسين يعقوب",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 15,
            "audio_type": "mp4"
        },
        {
            "title": "لقاء خاص الشيخ الحويني في ضيافة الشيخ مازن السرساوي",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 4,
            "audio_type": "mp4"
        },
        {
            "title": "لقاء يجمع بين الشيخ الحويني والشيخ المعصراوي",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 3,
            "audio_type": "mp4"
        },
        {
            "title": "لقاءات رحلة  المملكة العربية السعودية",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 14,
            "audio_type": "mp4"
        },
        {
            "title": "لقاءات رحلة دولة الكويت",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 20,
            "audio_type": "mp4"
        },
        {
            "title": "لقاءات رحلة دولة قطر",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 22,
            "audio_type": "mp4"
        },
        {
            "title": "لقاءالدكتور بشار عواد فى ضيافة الشيخ الحويني",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 8,
            "audio_type": "mp4"
        },
        {
            "title": "مجالس القرأن | قصة موسى والخضر",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 7,
            "audio_type": "mp4"
        },
        {
            "title": "مجالس يوم الجمعة",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 45,
            "audio_type": "mp4"
        },
        {
            "title": "محاضرات الجامعات المصرية",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 4,
            "audio_type": "mp4"
        },
        {
            "title": "محاضرات رحلة الأردن",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 11,
            "audio_type": "mp4"
        },
        {
            "title": "محاضرات مرئية",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 278,
            "audio_type": "mp4"
        },
        {
            "title": "محاضرات نادرة",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 36,
            "audio_type": "mp4"
        },
        {
            "title": "مدارج السالكين إلى الله",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 21,
            "audio_type": "mp4"
        },
        {
            "title": "مدرسة الحياة 1433 هـ",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 6,
            "audio_type": "mp4"
        },
        {
            "title": "مدرسة الحياة | سلسلة حقيقة العلم النافع",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 26,
            "audio_type": "mp4"
        },
        {
            "title": "مقاطع صوتيه",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 84,
            "audio_type": "mp4"
        },
        {
            "title": "من تجارب الشيخ الحويني 2025",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 15,
            "audio_type": "mp4"
        },
        {
            "title": "منطلقات طالب العلم",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 262,
            "audio_type": "mp4"
        },
        {
            "title": "موضوعات متنوعة",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 1102,
            "audio_type": "mp4"
        },
        {
            "title": "نظرات حول حديث سورة الكهف",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 6,
            "audio_type": "mp4"
        },
        {
            "title": "نظرات حول سورة الأنفال",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 10,
            "audio_type": "mp4"
        },
        {
            "title": "نفثة مصدور | سلسة مدرسة الحياة 1431 هـ",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 11,
            "audio_type": "mp4"
        },
        {
            "title": "هكذا الحب يافتي",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 7,
            "audio_type": "mp4"
        },
        {
            "title": "وقفات مع النقاب واللحية",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 24,
            "audio_type": "mp4"
        },
        {
            "title": "وقفات من سيرة عمرو بن العاص رضي الله عنه",
            "author": "الشيخ أبو إسحاق الحويني",
            "publisher": "بصوت الشيخ أبو إسحاق الحويني",
            "section": "مكتبة الشيخ الحويني",
            "year": "الإثنين 17 رمضان 1446هـ الموافق 17-3-2025 م",
            "audio_count": 2,
            "audio_type": "mp4"
        }
    ],
    "عقيدة": [
        {
            "title": "المنة 1  ",
            "author": "  د. ياسر برهامي",
            "publisher": "بشرح الشيخ د. ياسر برهامي",
            "section": "عقيدة",
            "year": 1984,
            "audio_count": 87,
            "audio_type": "mp3"
        },
        {
            "title": "المنة2 ",
            "author": "  د. ياسر برهامي",
            "publisher": "بشرح الشيخ د. ياسر برهامي",
            "section": "عقيدة",
            "year": 1984,
            "audio_count": 44,
            "audio_type": "mp3"
        },
        {
            "title": "سُلم الوصول",
            "author": " الشيخ حافظ بن أحمد حكمي",
            "publisher": "بشرح الشيخ د . خالد منصور",
            "section": "عقيدة",
            "year": 1984,
            "audio_count": 14,
            "audio_type": "mp4"
        },
        {
            "title": "الإبانة الصغري   ",
            "author": " إبن بطه",
            "publisher": "بشرح الشيخ د. خالد منصور",
            "section": "عقيدة",
            "year": 1984,
            "audio_count": 20,
            "audio_type": "mp4"
        },
        {
            "title": "المنظومة الحائية   ",
            "author": " أبي يكر بن أبي داوود",
            "publisher": "بشرح الشيخ د. خالد منصور",
            "section": "عقيدة",
            "year": 1984,
            "audio_count": 13,
            "audio_type": "mp4"
        },
        {
            "title": "القواعد الكلية    ",
            "author": "  الشيخ إبراهيم بن محمد البريكان",
            "publisher": "بشرح الشيخ د. خالد منصور",
            "section": "عقيدة",
            "year": 1984,
            "audio_count": 12,
            "audio_type": "mp4"
        },
        {
            "title": "المنة   ",
            "author": "  د. ياسر برهامي",
            "publisher": "بشرح الشيخ د. باسم عبد  رب الرسول",
            "section": "عقيدة",
            "year": 1984,
            "audio_count": 49,
            "audio_type": "mp4"
        },
        {
            "title": "فتح المجيد ",
            "author": "  عبدالرحمن بن حسن آل الشيخ",
            "publisher": "بشرح الشيخ د. ياسر برهامي",
            "section": "عقيدة",
            "year": 1984,
            "audio_count": 121,
            "audio_type": "mp3"
        },
        {
            "title": "فتح المجيد ",
            "author": "  عبدالرحمن بن حسن آل الشيخ",
            "publisher": "بشرح الشيخ د. خالد منصور",
            "section": "عقيدة",
            "year": 1984,
            "audio_count": 98,
            "audio_type": "mp4"
        },
        {
            "title": "القواعد المثلي   ",
            "author": "  الشيخ محمد بن صالح العثيمين",
            "publisher": "بشرح الشيخ عبدالرازق بن عبدالمحسن البدر",
            "section": "عقيدة",
            "year": 1984,
            "audio_count": 16,
            "audio_type": "mp3"
        },
        {
            "title": "القواعد المثلي   ",
            "author": "  الشيخ محمد بن صالح العثيمين",
            "publisher": "بشرح الشيخ د. خالد منصور",
            "section": "عقيدة",
            "year": 1984,
            "audio_count": 14,
            "audio_type": "mp4"
        },
        {
            "title": "كشف الشبهات  ",
            "author": "  الشيخ محمد بن عبدالوهاب ",
            "publisher": "بشرح الشيخ الدكتور عبد المحسن القاسم",
            "section": "عقيدة",
            "year": 1984,
            "audio_count": 38,
            "audio_type": "mp3"
        },
        {
            "title": "لمعة الإعتقاد  ",
            "author": "  الموفق بن قدامة المقدسي ",
            "publisher": "بشرح الشيخ د. محمد حسن عبدالغفار",
            "section": "عقيدة",
            "year": 1984,
            "audio_count": 17,
            "audio_type": "mp3"
        },
        {
            "title": "معارج الجنة    ",
            "author": "أبو عبدالله محمد بن عبدالسلام بن علي",
            "publisher": "بشرح الشيخ د. خالد منصور",
            "section": "عقيدة",
            "year": 1984,
            "audio_count": 58,
            "audio_type": "mp4"
        },
        {
            "title": "معارج القبول   ",
            "author": "  الشيخ حافظ بن أحمد الحكمي",
            "publisher": "بشرح الشيخ عبد الرزاق بن عبد المحسن البدر",
            "section": "عقيدة",
            "year": 1984,
            "audio_count": 280,
            "audio_type": "mp3"
        },
        {
            "title": "4/4 معارج القبول ",
            "author": "  حافظ أحمد حكمي",
            "publisher": "بشرح الشيخ د. ياسر برهامي",
            "section": "عقيدة",
            "year": 1984,
            "audio_count": 48,
            "audio_type": "mp3"
        },
        {
            "title": "1/4 معارج القبول ",
            "author": "  حافظ أحمد حكمي",
            "publisher": "بشرح الشيخ د. ياسر برهامي",
            "section": "عقيدة",
            "year": 1984,
            "audio_count": 57,
            "audio_type": "mp3"
        },
        {
            "title": "3/4 معارج القبول ",
            "author": "  حافظ أحمد حكمي",
            "publisher": "بشرح الشيخ د. ياسر برهامي",
            "section": "عقيدة",
            "year": 1984,
            "audio_count": 47,
            "audio_type": "mp3"
        },
        {
            "title": "2/4 معارج القبول ",
            "author": "  حافظ أحمد حكمي",
            "publisher": "بشرح الشيخ د. ياسر برهامي",
            "section": "عقيدة",
            "year": 1984,
            "audio_count": 31,
            "audio_type": "mp3"
        },
        {
            "title": "مسألة الإيمان ",
            "author": "  شمس الدين الذهبي",
            "publisher": "بشرح الشيخ د. خالد منصور",
            "section": "عقيدة",
            "year": 1984,
            "audio_count": 33,
            "audio_type": "mp4"
        },
        {
            "title": "مقدمة بن أبي زيد القيرواني   ",
            "author": "  بن أبي زيد القيرواني",
            "publisher": "بشرح الشيخ د. خالد منصور",
            "section": "عقيدة",
            "year": 1984,
            "audio_count": 9,
            "audio_type": "mp4"
        },
        {
            "title": "ثلاثة الأصول  ",
            "author": "  الشيخ محمد بن عبدالوهاب ",
            "publisher": "بشرح الشيخ د. عبدالمحسن القاسم",
            "section": "عقيدة",
            "year": 1984,
            "audio_count": 30,
            "audio_type": "mp3"
        },
        {
            "title": "العقدية الطحاوية   ",
            "author": "  الإمام الطحاوي",
            "publisher": "بشرح الشيخ عبدالرازق بن عبدالمحسن البدر",
            "section": "عقيدة",
            "year": 1984,
            "audio_count": 22,
            "audio_type": "mp3"
        },
        {
            "title": "العقدية الواسطية   ",
            "author": "  شيخ الإسلام بن تيميه",
            "publisher": "بشرح الشيخ عبدالرازق بن عبدالمحسن البدر",
            "section": "عقيدة",
            "year": 1984,
            "audio_count": 50,
            "audio_type": "mp3"
        },
        {
            "title": "العقدية الواسطية   ",
            "author": "  شيخ الإسلام بن تيميه",
            "publisher": "بشرح الشيخ د. ياسر برهامي",
            "section": "عقيدة",
            "year": 1984,
            "audio_count": 49,
            "audio_type": "mp4"
        }
    ],
    "فتاوي": [
        {
            "title": "فتاوي   ",
            "author": " ",
            "publisher": "بشرح الشيخ د. خالد منصور",
            "section": "فتاوي",
            "year": 1984,
            "audio_count": 96,
            "audio_type": "mp4"
        }
    ],
    "فقه": [
        {
            "title": "أخصر المختصرات",
            "author": "محمد بن بدر الدين بن بلبان الدمشقي الحنبلي",
            "publisher": " بشرح / الشيخ د. خالد منصور",
            "section": "فقه",
            "year": 1083,
            "audio_count": 70,
            "audio_type": "mp4"
        },
        {
            "title": "أخصر المختصرات",
            "author": "محمد بن بدر الدين بن بلبان الدمشقي الحنبلي",
            "publisher": " بشرح / الشيخ د. محمد محمود آل خضير",
            "section": "فقه",
            "year": 1083,
            "audio_count": 65,
            "audio_type": "mp3"
        },
        {
            "title": "الكافي",
            "author": "إبن قدامة المقدسي",
            "publisher": " بشرح / الشيخ عبدالرحمن العجلان",
            "section": "فقه",
            "year": 1083,
            "audio_count": 611,
            "audio_type": "mp3"
        },
        {
            "title": "الكافي",
            "author": "إبن قدامة المقدسي",
            "publisher": " بشرح / الشيخ محمد بن حمود الوائلي",
            "section": "فقه",
            "year": 1083,
            "audio_count": 850,
            "audio_type": "mp3"
        },
        {
            "title": "المبدع شرح المقنع",
            "author": "إبن مفلح الحنبلي",
            "publisher": " بشرح الشيخ ا.د. محمد العروسي عبدالقادر",
            "section": "فقه",
            "year": 1083,
            "audio_count": 1056,
            "audio_type": "mp3"
        },
        {
            "title": "المغني",
            "author": "إبن قدامة المقدسي",
            "publisher": " بشرح / الشيخ د. محمد حسن عبد الغفار",
            "section": "فقه",
            "year": 1083,
            "audio_count": 882,
            "audio_type": "mp4"
        },
        {
            "title": "متن الرحبية",
            "author": "إبي القاسم عمر بن الحسين الخرقي",
            "publisher": " بشرح / الشيخ سامي بن محمد الصقير",
            "section": "فقه",
            "year": 1083,
            "audio_count": 41,
            "audio_type": "mp3"
        },
        {
            "title": "متن الرحبية",
            "author": "الرحبي",
            "publisher": " بشرح / الشيخ د. خالد منصور",
            "section": "فقه",
            "year": 1083,
            "audio_count": 8,
            "audio_type": "mp4"
        },
        {
            "title": "الروضة الندية",
            "author": "الشيخ صديق حسن خان",
            "publisher": " بشرح / الشيخ د. خالد منصور",
            "section": "فقه",
            "year": 1083,
            "audio_count": 154,
            "audio_type": "mp3"
        },
        {
            "title": "بداية المجتهد",
            "author": "بن رشد الحفيد",
            "publisher": " بشرح / الشيخ محمد بن حمود الوائلي",
            "section": "فقه",
            "year": 1083,
            "audio_count": 832,
            "audio_type": "mp3"
        },
        {
            "title": "بلوغ المرام",
            "author": "بن حجر العسقلاني",
            "publisher": " بشرح / الشيخ سامي بن محمد الصقير",
            "section": "فقه",
            "year": 1083,
            "audio_count": 481,
            "audio_type": "mp3"
        },
        {
            "title": "الروض المربع",
            "author": "منصور بن يوسف البهوتي الحنبلي",
            "publisher": " بشرح / الشيخ د . سامي بن محمد الصقير",
            "section": "فقه",
            "year": 1083,
            "audio_count": 836,
            "audio_type": "mp3"
        },
        {
            "title": "الروض المربع",
            "author": "منصور بن يوسف البهوتي الحنبلي",
            "publisher": " بشرح / الشيخ د . خالد منصور",
            "section": "فقه",
            "year": 1083,
            "audio_count": 232,
            "audio_type": "mp4"
        },
        {
            "title": "فروع الفقه لإبن المبرد",
            "author": "إبن المبرد",
            "publisher": " بشرح / الشيخ د. خالد منصور",
            "section": "فقه",
            "year": 2002,
            "audio_count": 24,
            "audio_type": "mp4"
        },
        {
            "title": "منار السبيل",
            "author": "إبراهيم بن محمد بن ضويان الحنبلي",
            "publisher": " بشرح / الشيخ د. أحمد حطيبه",
            "section": "فقه",
            "year": 1083,
            "audio_count": 356,
            "audio_type": "mp3"
        },
        {
            "title": "منهج السالكين",
            "author": "عبدالرحمن بن ناصر السعدي",
            "publisher": " بشرح / الشيخ د. سامي بن محمد الصقير",
            "section": "فقه",
            "year": 2002,
            "audio_count": 81,
            "audio_type": "mp3"
        },
        {
            "title": "منهج السالكين",
            "author": "عبدالرحمن بن ناصر السعدي",
            "publisher": " بشرح / الشيخ د. خالد منصور",
            "section": "فقه",
            "year": 2002,
            "audio_count": 33,
            "audio_type": "mp3"
        },
        {
            "title": "منهج السالكين",
            "author": "عبدالرحمن بن ناصر السعدي",
            "publisher": " بشرح / الشيخ د. خالد منصور",
            "section": "فقه",
            "year": 2002,
            "audio_count": 48,
            "audio_type": "mp4"
        },
        {
            "title": "مختصر الخرقي",
            "author": "إبي القاسم عمر بن الحسين الخرقي",
            "publisher": " بشرح / الشيخ د . عبدالكريم الخضير",
            "section": "فقه",
            "year": 1083,
            "audio_count": 245,
            "audio_type": "mp3"
        },
        {
            "title": "منتهي الإرادات",
            "author": "إبن النجار الفتوحي",
            "publisher": " بشرح / الشيخ عبدالرحمن العجلان",
            "section": "فقه",
            "year": 1083,
            "audio_count": 1085,
            "audio_type": "mp3"
        },
        {
            "title": "عمدة الأحكام",
            "author": "أبي محمد بن عبدالغني المقدسي",
            "publisher": " بشرح / الشيخ عبدالسلام الشويعر",
            "section": "فقه",
            "year": 1083,
            "audio_count": 51,
            "audio_type": "mp3"
        },
        {
            "title": "تيسير العلام",
            "author": "عبدالله بن عبدالرحمن البسام",
            "publisher": " بشرح / الشيخ عبد الرحمن بن عبد الله العجلان",
            "section": "فقه",
            "year": 1083,
            "audio_count": 256,
            "audio_type": "mp3"
        },
        {
            "title": "زاد المستقنع",
            "author": "شرف الدين أبي النجا موسى  بن أحمد الحجاوي",
            "publisher": " بشرح / الشيخ محمد بن محمد المختار الشنقيطي",
            "section": "فقه",
            "year": 1083,
            "audio_count": 369,
            "audio_type": "mp4"
        },
        {
            "title": "زاد المستقنع",
            "author": "شرف الدين أبي النجا موسى  بن أحمد الحجاوي",
            "publisher": " بشرح / الشيخ عبدالسلام الشويعر",
            "section": "فقه",
            "year": 1083,
            "audio_count": 111,
            "audio_type": "mp3"
        },
        {
            "title": "زاد المستقنع",
            "author": "شرف الدين أبي النجا موسى  بن أحمد الحجاوي",
            "publisher": " بشرح / الشيخ د . سامي بن محمد الصقير",
            "section": "فقه",
            "year": 1083,
            "audio_count": 488,
            "audio_type": "mp3"
        }
    ],
    "فرق ومذاهب": [
        {
            "title": "اصول الفرق والمذاهب  ",
            "author": " الشيخ سفر الحوالي",
            "publisher": "بشرح الشيخ د. خالد منصور",
            "section": "فرق ومذاهب",
            "year": 1984,
            "audio_count": 9,
            "audio_type": "mp4"
        }
    ],
    "شروح الحديث": [
        {
            "title": "كتاب الأدب  ",
            "author": "  الإمام البخاري",
            "publisher": "بشرح الشيخ د. خالد منصور",
            "section": "شروح الحديث",
            "year": 2000,
            "audio_count": 11,
            "audio_type": "mp4"
        },
        {
            "title": "الأربعين النووية  ",
            "author": "  الإمام النووي",
            "publisher": "بشرح الشيخ الدكتور سامي بن محمد الصقير",
            "section": "شروح الحديث",
            "year": 2000,
            "audio_count": 14,
            "audio_type": "mp3"
        },
        {
            "title": "موطأ مالك  ",
            "author": "  الإمام مالك",
            "publisher": "بشرح الشيخ الشيخ الدكتور عبد الكريم الخضير",
            "section": "شروح الحديث",
            "year": 2000,
            "audio_count": 233,
            "audio_type": "mp3"
        },
        {
            "title": "رياض الصالحين  ",
            "author": "  الإمام النووي",
            "publisher": "بشرح الشيخ الدكتور عبد الرزاق بن عبد المحسن البدر",
            "section": "شروح الحديث",
            "year": 2000,
            "audio_count": 404,
            "audio_type": "mp3"
        },
        {
            "title": "صحيح البخاري  ",
            "author": "  الإمام البخاري",
            "publisher": "بشرح الشيخ محمد بن صالح العثيمين",
            "section": "شروح الحديث",
            "year": 2000,
            "audio_count": 554,
            "audio_type": "mp3"
        },
        {
            "title": "صحيح مسلم  ",
            "author": "  الإمام مسلم بن الحجاج",
            "publisher": "بشرح الشيخ محمد بن صالح العثيمين",
            "section": "شروح الحديث",
            "year": 2000,
            "audio_count": 346,
            "audio_type": "mp3"
        },
        {
            "title": "سنن أبي داوود  ",
            "author": "  الإمام أبي داوود",
            "publisher": "بشرح الشيخ عبد المحسن بن حمد العباد البدر",
            "section": "شروح الحديث",
            "year": 2000,
            "audio_count": 374,
            "audio_type": "mp3"
        },
        {
            "title": "سنن النسائي  ",
            "author": "  الإمام النسائي",
            "publisher": "بشرح الشيخ عبد المحسن بن حمد العباد البدر",
            "section": "شروح الحديث",
            "year": 2000,
            "audio_count": 669,
            "audio_type": "mp3"
        },
        {
            "title": "سنن الترمذي  ",
            "author": "  الإمام الترمذي",
            "publisher": "بشرح الشيخ عبد المحسن بن حمد العباد البدر",
            "section": "شروح الحديث",
            "year": 2000,
            "audio_count": 434,
            "audio_type": "mp3"
        }
    ],
    "قضايا فكرية": [
        {
            "title": "الأمر بالمعروف ",
            "author": "  الشيخ ياسر برهامي",
            "publisher": "بشرح  الشيخ د . ياسر برهامي",
            "section": "قضايا فكرية",
            "year": 2000,
            "audio_count": 54,
            "audio_type": "mp3"
        },
        {
            "title": "دراسات في النصرانية ",
            "author": "  د. محمود مزروعة",
            "publisher": "بشرح  الشيخ خالد منصور",
            "section": "قضايا فكرية",
            "year": 2000,
            "audio_count": 13,
            "audio_type": "mp3"
        },
        {
            "title": "العمل الجماعي ",
            "author": "  الشيخ ياسر برهامي",
            "publisher": "بشرح  المهندس عبدالمنعم الشحات",
            "section": "قضايا فكرية",
            "year": 2000,
            "audio_count": 10,
            "audio_type": "mp3"
        },
        {
            "title": "العمل الجماعي ",
            "author": "  الشيخ ياسر برهامي",
            "publisher": "بشرح  د . خالد منصور",
            "section": "قضايا فكرية",
            "year": 2000,
            "audio_count": 4,
            "audio_type": "mp4"
        },
        {
            "title": "الحاكمية ",
            "author": "  الشيخ ياسر برهامي",
            "publisher": "بشرح  المهندس عبدالمنعم الشحات",
            "section": "قضايا فكرية",
            "year": 2000,
            "audio_count": 10,
            "audio_type": "mp3"
        },
        {
            "title": "الحكم بما أنزل الله ",
            "author": "  الشيخ ياسر برهامي",
            "publisher": "بشرح  د . حالد منصور",
            "section": "قضايا فكرية",
            "year": 2000,
            "audio_count": 8,
            "audio_type": "mp4"
        },
        {
            "title": "فقه الجهاد ",
            "author": "  الشيخ ياسر برهامي",
            "publisher": "بشرح  الشيخ رضا ثابت",
            "section": "قضايا فكرية",
            "year": 2000,
            "audio_count": 4,
            "audio_type": "mp3"
        },
        {
            "title": "فقه الخلاف ",
            "author": "  الشيخ ياسر برهامي",
            "publisher": "بشرح المهندس عبدالمنعم الشحات",
            "section": "قضايا فكرية",
            "year": 2000,
            "audio_count": 121,
            "audio_type": "mp3"
        },
        {
            "title": "الإيمان والكفر ",
            "author": "  الشيخ ياسر برهامي",
            "publisher": "بشرح الشيخ د . ياسر برهامي",
            "section": "قضايا فكرية",
            "year": 2000,
            "audio_count": 73,
            "audio_type": "mp3"
        },
        {
            "title": "الإيمان والكفر ",
            "author": "  الشيخ ياسر برهامي",
            "publisher": "بشرح الشيخ الدكتور خالد منصور",
            "section": "قضايا فكرية",
            "year": 2000,
            "audio_count": 15,
            "audio_type": "mp4"
        },
        {
            "title": "القضاء والقدر ",
            "author": "  الشيخ ياسر برهامي",
            "publisher": "بشرح الشيخ د . ياسر برهامي",
            "section": "قضايا فكرية",
            "year": 2000,
            "audio_count": 11,
            "audio_type": "mp3"
        },
        {
            "title": "القضاء والقدر ",
            "author": "  الشيخ ياسر برهامي",
            "publisher": "بشرح الشيخ د . خالد منصور",
            "section": "قضايا فكرية",
            "year": 2000,
            "audio_count": 4,
            "audio_type": "mp4"
        },
        {
            "title": "ملامح رئيسية للمنهج السلفي ",
            "author": "  الشيخ ياسر برهامي",
            "publisher": "بشرح  د . حالد منصور",
            "section": "قضايا فكرية",
            "year": 2000,
            "audio_count": 24,
            "audio_type": "mp4"
        },
        {
            "title": "مناهج الإستدلال عند أهل السنة ",
            "author": "  الدكتور مفرح بن سليمان القوسي",
            "publisher": "بشرح الشيخ الدكتور خالد منصور",
            "section": "قضايا فكرية",
            "year": 2000,
            "audio_count": 41,
            "audio_type": "mp4"
        },
        {
            "title": "أدلة إعتبار المصالح والمفاسد ",
            "author": "  الشيخ ياسر برهامي",
            "publisher": "بشرح الشيخ د . ياسر برهامي",
            "section": "قضايا فكرية",
            "year": 2000,
            "audio_count": 36,
            "audio_type": "mp3"
        },
        {
            "title": "الولاء والبراء ",
            "author": "  الشيخ ياسر برهامي",
            "publisher": "بشرح الشيخ المهندس عبدالمنعم الشحات",
            "section": "قضايا فكرية",
            "year": 2000,
            "audio_count": 36,
            "audio_type": "mp3"
        },
        {
            "title": "الولاء والبراء ",
            "author": "  الشيخ ياسر برهامي",
            "publisher": "بشرح الشيخ د . خالد منصور",
            "section": "قضايا فكرية",
            "year": 2000,
            "audio_count": 4,
            "audio_type": "mp4"
        }
    ],
    "قواعد الفقه": [
        {
            "title": "المنظومة السعدية  ",
            "author": "  سعد بن ناصر بن عبدالعزيز",
            "publisher": "بشرح المهندس عبدالمنعم الشحات",
            "section": "قواعد الفقه",
            "year": 2000,
            "audio_count": 121,
            "audio_type": "mp3"
        },
        {
            "title": "المنظومة السعدية  ",
            "author": "  سعد بن ناصر بن عبدالعزيز",
            "publisher": "بشرح الشيخ د. خالد منصور",
            "section": "قواعد الفقه",
            "year": 2000,
            "audio_count": 15,
            "audio_type": "mp4"
        }
    ],
    "خطب منبرية": [
        {
            "title": "1 الشيخ أبي إسحاق الحويني   ",
            "author": " الشيخ أبي إسحاق الحويني",
            "publisher": "الشيخ أبي إسحاق الحويني",
            "section": "خطب منبرية",
            "year": 2000,
            "audio_count": 250,
            "audio_type": "mp3"
        },
        {
            "title": " 2 الشيخ أبي إسحاق الحويني   ",
            "author": " الشيخ أبي إسحاق الحويني",
            "publisher": "الشيخ أبي إسحاق الحويني",
            "section": "خطب منبرية",
            "year": 2000,
            "audio_count": 577,
            "audio_type": "mp3"
        },
        {
            "title": " الشيخ خالد الراشد   ",
            "author": " الشيخ خالد الراشد",
            "publisher": "الشيخ خالد الراشد",
            "section": "خطب منبرية",
            "year": 2000,
            "audio_count": 124,
            "audio_type": "mp3"
        },
        {
            "title": "خطب متنوعة 1  ",
            "author": " مجموعة دعاة",
            "publisher": "مجموعة دعاة",
            "section": "خطب منبرية",
            "year": 2000,
            "audio_count": 212,
            "audio_type": "mp3"
        },
        {
            "title": " الشيخ محمد حسان   ",
            "author": " الشيخ محمد حسان",
            "publisher": "الشيخ محمد حسان",
            "section": "خطب منبرية",
            "year": 2000,
            "audio_count": 104,
            "audio_type": "mp3"
        },
        {
            "title": " الشيخ محمد حسين يعقوب   ",
            "author": " الشيخ محمد حسين يعقوب",
            "publisher": "الشيخ محمد حسين يعقوب",
            "section": "خطب منبرية",
            "year": 2000,
            "audio_count": 675,
            "audio_type": "mp3"
        },
        {
            "title": " الشيخ سمير مصطفى 1  ",
            "author": " الشيخ سمير مصطفى",
            "publisher": "الشيخ سمير مصطفى",
            "section": "خطب منبرية",
            "year": 2000,
            "audio_count": 160,
            "audio_type": "mp3"
        },
        {
            "title": " الشيخ سمير مصطفى 2  ",
            "author": " الشيخ سمير مصطفى",
            "publisher": "الشيخ سمير مصطفى",
            "section": "خطب منبرية",
            "year": 2000,
            "audio_count": 80,
            "audio_type": "mp3"
        }
    ],
    "اللغة العربية": [
        {
            "title": "ألفية بن مالك  ",
            "author": " العيوني",
            "publisher": "بشرح الشيخ فريد الزامل",
            "section": "اللغة العربية",
            "year": 1984,
            "audio_count": 6,
            "audio_type": "mp3"
        },
        {
            "title": "الأجرومية  ",
            "author": " أبي عبدالله بن عثمان الصنهاجي",
            "publisher": "بشرح الشيخ د. خالد منصور",
            "section": "اللغة العربية",
            "year": 1984,
            "audio_count": 6,
            "audio_type": "mp4"
        },
        {
            "title": "الجوهر المكنون في البلاغة  ",
            "author": " عبدالرحمن بن صغير الأخضري",
            "publisher": "بشرح  الشيخ العلامة أحمد بن عمر الحازمي",
            "section": "اللغة العربية",
            "year": 1984,
            "audio_count": 49,
            "audio_type": "mp3"
        },
        {
            "title": "النحوالصغير  ",
            "author": " العيوني",
            "publisher": "بشرح الشيخ فريد الزامل",
            "section": "اللغة العربية",
            "year": 1984,
            "audio_count": 6,
            "audio_type": "mp3"
        },
        {
            "title": "باكورة التعريف  ",
            "author": " محمد ابن أحمد الشنقيطي",
            "publisher": "بشرح الشيخ محمد بن أحمد الفزاني",
            "section": "اللغة العربية",
            "year": 1984,
            "audio_count": 6,
            "audio_type": "mp3"
        },
        {
            "title": "دروس البلاغة  ",
            "author": " حفني ناصف ومجموعة أخرى",
            "publisher": "بشرح الأستاذ محمود الشافعي",
            "section": "اللغة العربية",
            "year": 1984,
            "audio_count": 60,
            "audio_type": "mp3"
        },
        {
            "title": "قطر الندي  ",
            "author": " الشيخ أبي هشام الأنصارى",
            "publisher": "بشرح الشيخ سالم القحطاني",
            "section": "اللغة العربية",
            "year": 1984,
            "audio_count": 60,
            "audio_type": "mp3"
        },
        {
            "title": "مئة المعاني  ",
            "author": " محب الدين بن الشحنة",
            "publisher": "بشرح  الشيخ العلامة أحمد بن عمر الحازمي",
            "section": "اللغة العربية",
            "year": 1984,
            "audio_count": 18,
            "audio_type": "mp3"
        },
        {
            "title": "مغني اللبيب  ",
            "author": " الإمام ابن هشام الأنصاري",
            "publisher": "بشرح الشيخ أحمد شوقي",
            "section": "اللغة العربية",
            "year": 1984,
            "audio_count": 145,
            "audio_type": "mp3"
        },
        {
            "title": "نظم قواعد الإعراب  ",
            "author": " الزواوي",
            "publisher": "بشرح الشيخ محمد بن سعيد الطوق",
            "section": "اللغة العربية",
            "year": 1984,
            "audio_count": 10,
            "audio_type": "mp3"
        },
        {
            "title": "شذور الذهب  ",
            "author": " الإمام ابن هشام الأنصاري",
            "publisher": "بشرح الشيخ د. فهد البحري",
            "section": "اللغة العربية",
            "year": 1984,
            "audio_count": 41,
            "audio_type": "mp3"
        }
    ],
    "مصطلح حديث": [
        {
            "title": "المنظومة البيقونية  ",
            "author": "  عمر بن محمد بن فتوح البيقوني",
            "publisher": "بشرح الشيخ سامي بن محمد الصقير",
            "section": "مصطلح حديث",
            "year": 1984,
            "audio_count": 10,
            "audio_type": "mp3"
        },
        {
            "title": "الباعث الحثيث  ",
            "author": "  إبن كثير",
            "publisher": "بشرح الشيخ د . عبدالكريم الخضير",
            "section": "مصطلح حديث",
            "year": 1984,
            "audio_count": 19,
            "audio_type": "mp3"
        },
        {
            "title": "الباعث الحثيث  ",
            "author": "  إبن كثير",
            "publisher": "بشرح الشيخ أبي إسحاق الحويني",
            "section": "مصطلح حديث",
            "year": 1984,
            "audio_count": 15,
            "audio_type": "mp4"
        },
        {
            "title": "نزهة النظر  ",
            "author": "  بن حجر العسقلاني",
            "publisher": "بشرح المهندس عبدالمنعم الشحات",
            "section": "مصطلح حديث",
            "year": 1984,
            "audio_count": 34,
            "audio_type": "mp3"
        },
        {
            "title": "تيسير مصطلح الحديث  ",
            "author": "  د. محمود الطحان",
            "publisher": "بشرح الشيخ د. عثمان الخميس",
            "section": "مصطلح حديث",
            "year": 1984,
            "audio_count": 17,
            "audio_type": "mp3"
        }
    ],
    "اصول البدع": [
        {
            "title": "قواعد معرفة البدع  ",
            "author": " محمد بن حسين الجيزاني",
            "publisher": "بشرح الشيخ د. خالد منصور",
            "section": "اصول البدع",
            "year": 1984,
            "audio_count": 18,
            "audio_type": "mp4"
        },
        {
            "title": "مناهج الاستدلال عند المبتدعة  ",
            "author": " مجموعة كتب",
            "publisher": "بشرح الشيخ د. خالد منصور",
            "section": "اصول البدع",
            "year": 1984,
            "audio_count": 82,
            "audio_type": "mp4"
        },
        {
            "title": "معيار البدعة  ",
            "author": " محمد بن حسين الجيزاني",
            "publisher": "بشرح الشيخ د. خالد منصور",
            "section": "اصول البدع",
            "year": 1984,
            "audio_count": 22,
            "audio_type": "mp3"
        }
    ],
    "أصول فقه": [
        {
            "title": "الأصول من علم الأصول",
            "author": " محمد بن صالح العثيمين",
            "publisher": "بشرح الشيخ عبد المنعم الشحات",
            "section": "أصول فقه",
            "year": 1984,
            "audio_count": 4,
            "audio_type": "mp3"
        },
        {
            "title": "الرسالة ",
            "author": "الإمام الشافعي",
            "publisher": "بشرح الشيخ د. محمد حسن عبدالغفار",
            "section": "أصول فقه",
            "year": 1984,
            "audio_count": 56,
            "audio_type": "mp3"
        },
        {
            "title": "التذكرة ",
            "author": " الإمام الحسن بن بدر الدين بن عبدالغني المقدسي الحنبلي.",
            "publisher": "بشرح الشيخ د . خالد منصور",
            "section": "أصول فقه",
            "year": 1984,
            "audio_count": 16,
            "audio_type": "mp4"
        },
        {
            "title": "الورقات",
            "author": " الإمام الجويني",
            "publisher": "بشرح الشيخ د . خالد منصور",
            "section": "أصول فقه",
            "year": 1984,
            "audio_count": 22,
            "audio_type": "mp4"
        },
        {
            "title": "الواضح في أصول الفقه",
            "author": "د. محمد سليمان الأشقر",
            "publisher": "بشرح الشيخ عبد المنعم الشحات",
            "section": "أصول فقه",
            "year": 1984,
            "audio_count": 100,
            "audio_type": "mp3"
        },
        {
            "title": "الواضح في أصول الفقه",
            "author": "د. محمد سليمان الأشقر",
            "publisher": "بشرح الشيخ أحمد نبيل شمس الدين",
            "section": "أصول فقه",
            "year": 1984,
            "audio_count": 36,
            "audio_type": "mp4"
        },
        {
            "title": "غَايَة السُّول إلى علم الأصول",
            "author": "يوسف بن حسن بن أحمد بن عبد الهادي الحنبلي الدمشقي",
            "publisher": "بشرح الشيخ عبد السلام الشويعر",
            "section": "أصول فقه",
            "year": 2000,
            "audio_count": 26,
            "audio_type": "mp3"
        },
        {
            "title": "قواعد أصول الفقه ",
            "author": " بن عبدالهادي الحنبلي",
            "publisher": "بشرح الشيخ د . خالد منصور",
            "section": "أصول فقه",
            "year": 1984,
            "audio_count": 10,
            "audio_type": "mp4"
        },
        {
            "title": "قواعد الأصول ",
            "author": "صفي الدين عبدالمؤمن البغدادي",
            "publisher": "بشرح الشيخ د . خالد منصور",
            "section": "أصول فقه",
            "year": 1984,
            "audio_count": 16,
            "audio_type": "mp4"
        },
        {
            "title": "روضة الناظر ",
            "author": "إبن قدامة المقدسي",
            "publisher": "بشرح الشيخ عبد المنعم الشحات",
            "section": "أصول فقه",
            "year": 1984,
            "audio_count": 57,
            "audio_type": "mp3"
        }
    ],
    "أصول تفسير": [
        {
            "title": "مقدمة في أصول التفسير",
            "author": "د. مساعد الطيار",
            "publisher": "بصوت د / خالد منصور",
            "section": "أصول تفسير",
            "year": 2008,
            "audio_count": 16,
            "audio_type": "mp4"
        }
    ],
    "سيرة": [
        {
            "title": "الخلافة الراشدة",
            "author": "د. راغب السرجاني",
            "publisher": "د. راغب السرجاني",
            "section": "سيرة",
            "year": 2007,
            "audio_count": 159,
            "audio_type": "mp3"
        },
        {
            "title": "السيرة النبوية",
            "author": "د. راغب السرجاني",
            "publisher": "د. راغب السرجاني",
            "section": "سيرة",
            "year": 2007,
            "audio_count": 46,
            "audio_type": "mp3"
        },
        {
            "title": "العشرة المبشرون بالجنة",
            "author": "",
            "publisher": "بصوت د / علي بشير أحمد",
            "section": "سيرة",
            "year": 2007,
            "audio_count": 30,
            "audio_type": "mp3"
        },
        {
            "title": "مختصر السيرة النبوية",
            "author": "موسی بن راشد العازمی",
            "publisher": "بصوت د / علي بشير أحمد",
            "section": "سيرة",
            "year": 2022,
            "audio_count": 205,
            "audio_type": "mp3"
        },
        {
            "title": "الأرجوزة الميئية",
            "author": "إبن أبي العز الحنفي",
            "publisher": "بصوت د . خالد منصور",
            "section": "سيرة",
            "year": 2008,
            "audio_count": 10,
            "audio_type": "mp4"
        },
        {
            "title": "الرحيق المختوم",
            "author": "صفي الرحمن المباركافوري",
            "publisher": "بشرح الشيخ د ياسر برهامي",
            "section": "سيرة",
            "year": 2007,
            "audio_count": 205,
            "audio_type": "mp3"
        },
        {
            "title": "الشمائل المحمدية",
            "author": "الإمام الترمذي",
            "publisher": "بصوت د . خالد منصور",
            "section": "سيرة",
            "year": 2008,
            "audio_count": 4,
            "audio_type": "mp4"
        },
        {
            "title": "صور من حياة الصحابة",
            "author": "عبدالرحمن رأفت الباشا",
            "publisher": "بصوت د / علي بشير أحمد",
            "section": "سيرة",
            "year": 2008,
            "audio_count": 108,
            "audio_type": "mp3"
        },
        {
            "title": "صور من حياة التابعين",
            "author": "عبدالرحمن رأفت الباشا",
            "publisher": "بصوت د / علي بشير أحمد",
            "section": "سيرة",
            "year": 2020,
            "audio_count": 37,
            "audio_type": "mp3"
        }
    ],
    "تفسير": [
        {
            "title": "تفسير القرطبي",
            "author": "ابن كثير",
            "publisher": "بشرح الشيخ عبد الله بن محمد الأمين الشنقيطي",
            "section": "تفسير",
            "year": 2007,
            "audio_count": 863,
            "audio_type": "mp3"
        },
        {
            "title": "تفسير السعدي",
            "author": "الشيخ عبدالرحمن بن ناصر السعدي",
            "publisher": "بشرح الشيخ د. خالد منصور",
            "section": "تفسير",
            "year": 2007,
            "audio_count": 6,
            "audio_type": "mp4"
        },
        {
            "title": "تفسير جزء عم",
            "author": "ابن كثير",
            "publisher": "بشرح الشيخ  د . خالد منصور",
            "section": "تفسير",
            "year": 2007,
            "audio_count": 39,
            "audio_type": "mp4"
        },
        {
            "title": "تفسير بن كثير",
            "author": "ابن كثير",
            "publisher": "بشرح الشيخ  عبد الرحمن بن عبد الله العجلان",
            "section": "تفسير",
            "year": 2007,
            "audio_count": 1258,
            "audio_type": "mp3"
        }
    ],
    "تاريخ": [
        {
            "title": "الأندلس من الفتح إلى السقوط",
            "author": "د. راغب السرجاني",
            "publisher": "د. راغب السرجاني",
            "section": "تاريخ",
            "year": 2007,
            "audio_count": 12,
            "audio_type": "mp3"
        },
        {
            "title": "التتار من البداية إلى عين جالوت",
            "author": "د. راغب السرجاني",
            "publisher": "د. راغب السرجاني",
            "section": "تاريخ",
            "year": 2007,
            "audio_count": 12,
            "audio_type": "mp3"
        },
        {
            "title": "الحروب الصليبية",
            "author": "د. راغب السرجاني",
            "publisher": "د. راغب السرجاني",
            "section": "تاريخ",
            "year": 2007,
            "audio_count": 30,
            "audio_type": "mp3"
        },
        {
            "title": "فلسطين من الفتح إلى اليرموك",
            "author": "د. راغب السرجاني",
            "publisher": "د. راغب السرجاني",
            "section": "تاريخ",
            "year": 2007,
            "audio_count": 10,
            "audio_type": "mp3"
        }
    ],
    "تربية و تزكية": [
        {
            "title": "الداء والدواء  ",
            "author": " إبن القيم الجوزية",
            "publisher": "بشرح الشيخ د. خالد منصور",
            "section": "تربية و تزكية",
            "year": 1984,
            "audio_count": 10,
            "audio_type": "mp4"
        },
        {
            "title": "كُن صحابياً",
            "author": "د. راغب السرجاني",
            "publisher": "د. راغب السرجاني",
            "section": "تربية و تزكية",
            "year": 2007,
            "audio_count": 12,
            "audio_type": "mp3"
        },
        {
            "title": " مدارج السالكين   ",
            "author": " إبن القيم الجوزية",
            "publisher": "الشيخ محمد حسين يعقوب",
            "section": "تربية و تزكية",
            "year": 2000,
            "audio_count": 95,
            "audio_type": "mp3"
        },
        {
            "title": "مشكلات وحلول 1  ",
            "author": " ",
            "publisher": "بشرح الشيخ د. خالد منصور",
            "section": "تربية و تزكية",
            "year": 1984,
            "audio_count": 10,
            "audio_type": "mp4"
        },
        {
            "title": "مشكلات وحلول 2  ",
            "author": " ",
            "publisher": "بشرح الشيخ د. خالد منصور",
            "section": "تربية و تزكية",
            "year": 1984,
            "audio_count": 10,
            "audio_type": "mp4"
        },
        {
            "title": "مشكلات وحلول 3  ",
            "author": " ",
            "publisher": "بشرح الشيخ د. خالد منصور",
            "section": "تربية و تزكية",
            "year": 1984,
            "audio_count": 15,
            "audio_type": "mp4"
        },
        {
            "title": "رفع الملام عن الائمة الأعلام  ",
            "author": " إبن تيمية",
            "publisher": "بشرح الشيخ د. خالد منصور",
            "section": "تربية و تزكية",
            "year": 1984,
            "audio_count": 11,
            "audio_type": "mp4"
        }
    ]
}

module.exports = {
  siteUrl: 'https://talep-elm.vercel.app/',
  generateRobotsTxt: true,
  // generateIndexSitemap: true,
  generateIndexSitemap: false,
  sitemapIndexLastmod: true,
  autoLastmod: true,
  outDir: 'public',
  sitemapSize: 7000,
  sitemapBaseFileName: 'sitemap',
  sitemapPath: '/sitemap.xml',
  indexedDB: true,
  xmlNs: {
    news: 'http://www.google.com/schemas/sitemap-news/0.9',
    xhtml: 'http://www.w3.org/1999/xhtml',
    mobile: 'http://www.google.com/schemas/sitemap-mobile/1.0',
    image: 'http://www.google.com/schemas/sitemap-image/1.1',
    video: 'http://www.google.com/schemas/sitemap-video/1.1',
    xsi: 'http://www.w3.org/2001/XMLSchema-instance',
    schemaLocation: 'http://www.sitemaps.org/schemas/sitemap/0.9 http://www.sitemaps.org/schemas/sitemap/0.9/sitemap.xsd',
  },
  additionalPaths: async () => {
    const urls = [
      '/', '/about', '/contact', '/moshaf', '/booksound',

      // Users Dashboard
      '/users/dashboard/articles',
      '/users/dashboard/sections',
      '/users/dashboard/subjects',
      '/users/dashboard/assinments',
      '/users/dashboard/exams',
      '/users/dashboard/profile',

      // Admins Dashboard
      '/admins/dashboard/articles',
      '/admins/dashboard/sections',
      '/admins/dashboard/subjects',
      '/admins/dashboard/assinments',
      '/admins/dashboard/exams',
      '/admins/dashboard/profile',
      '/admins/dashboard/add-article',
      '/admins/dashboard/assinments-results',
      '/admins/dashboard/exams-results',
      '/admins/dashboard/groups',

      // Teachers Dashboard
      '/teachers/dashboard/articles',
      '/teachers/dashboard/sections',
      '/teachers/dashboard/subjects',
      '/teachers/dashboard/assinments',
      '/teachers/dashboard/exams',
      '/teachers/dashboard/profile',
      '/teachers/dashboard/add-article',
      '/teachers/dashboard/assinments-results',
      '/teachers/dashboard/exams-results',
      '/teachers/dashboard/groups',
      '/teachers/dashboard/add-assinment',
      '/teachers/dashboard/add-exam',
      '/teachers/dashboard/add-lesson',

      // Admin-Teacher Dashboard
      '/admin-teacher/dashboard/articles',
      '/admin-teacher/dashboard/sections',
      '/admin-teacher/dashboard/subjects',
      '/admin-teacher/dashboard/assinments',
      '/admin-teacher/dashboard/exams',
      '/admin-teacher/dashboard/profile',
      '/admin-teacher/dashboard/add-article',
      '/admin-teacher/dashboard/assinments-results',
      '/admin-teacher/dashboard/exams-results',
      '/admin-teacher/dashboard/groups',
      '/admin-teacher/dashboard/add-assinment',
      '/admin-teacher/dashboard/add-exam',
      '/admin-teacher/dashboard/add-lesson',
      '/admin-teacher/dashboard/add-group',
      '/admin-teacher/dashboard/admins',
      '/admin-teacher/dashboard/teachers',

      // Managers Dashboard
      '/managers/dashboard/articles',
      '/managers/dashboard/sections',
      '/managers/dashboard/subjects',
      '/managers/dashboard/assinments',
      '/managers/dashboard/exams',
      '/managers/dashboard/profile',
      '/managers/dashboard/add-article',
      '/managers/dashboard/assinments-results',
      '/managers/dashboard/exams-results',
      '/managers/dashboard/groups',
      '/managers/dashboard/add-assinment',
      '/managers/dashboard/add-exam',
      '/managers/dashboard/add-lesson',
      '/managers/dashboard/add-group',
      '/managers/dashboard/admins',
      '/managers/dashboard/teachers',
      '/managers/dashboard/admins-teachers',
      '/managers/dashboard/students',

      // Owner Dashboard
      '/owner/dashboard/articles',
      '/owner/dashboard/sections',
      '/owner/dashboard/subjects',
      '/owner/dashboard/assinments',
      '/owner/dashboard/exams',
      '/owner/dashboard/profile',
      '/owner/dashboard/add-article',
      '/owner/dashboard/assinments-results',
      '/owner/dashboard/exams-results',
      '/owner/dashboard/groups',
      '/owner/dashboard/add-assinment',
      '/owner/dashboard/add-exam',
      '/owner/dashboard/add-lesson',
      '/owner/dashboard/add-group',
      '/owner/dashboard/admins',
      '/owner/dashboard/teachers',
      '/owner/dashboard/admins-teachers',
      '/owner/dashboard/students',
      '/owner/dashboard/codes',
      '/owner/dashboard/managers',
      '/owner/dashboard/news',
    ];

    const dynamicUrls = [];
    
    // روابط القراء والسور
    quraanQaree.forEach((qaree) => {
      quraanSuras.forEach((sora) => {
        dynamicUrls.push({
          loc: `/moshaf?القارىء=${encodeURIComponent(qaree)}&السورة=${encodeURIComponent(sora)}`,
          lastmod: new Date().toISOString(),
          changefreq: 'weekly',
          priority: 0.7,
        });
      });
    });

    // روابط الإذاعات
    radios.forEach((radio) => {
      dynamicUrls.push({
        loc: `/?radio=${encodeURIComponent(radio)}`,
        lastmod: new Date().toISOString(),
        changefreq: 'weekly',
        priority: 0.7,
      });
    });

    // روابط الخطب
    Object.keys(khotap).forEach((section) => {
      khotap[section].forEach((khotb) =>
        dynamicUrls.push({
          loc: `/booksound?القسم=${encodeURIComponent(section)}&كتاب=${encodeURIComponent(khotb.title)}&المؤلف=${encodeURIComponent(khotb.author)}&بشرح=${encodeURIComponent(khotb.publisher)}`,
          lastmod: new Date().toISOString(),
          changefreq: 'weekly',
          priority: 0.7,
        })
      );
    }
    );

    return [...urls.map((url) => ({
      loc: url,
      lastmod: new Date().toISOString(),
      changefreq: url === '/' ? 'daily' : 'weekly',
      priority: url === '/' ? 1.0 : 0.7,
    })), ...dynamicUrls];
  },
};