
export default function page() {
  return (
    <>
      <section>
        <div className="container">
          <div className="row">
            <div className="col-md-12 w-full flex justify-center flex-col gap-6 items-center mt-5">
              <h1 className="text-center text-5xl">مرحباً بكم في موقعنا </h1>
              <p className=" w-full text-lg text-text_color text-justify ">
                نحن نتشرف أن نقدم  لك عزيزي الزائر الدورات العلمية التى تؤهلك لفهم صحيح الدين على الكتاب والسنة , وضحض الشبهات التى أتى بها الأولون وسار على دربهم الأخرون , ونتمنى أن تكون هذه الدورات منفعة لكم ونتمنى أن نلتقي جميعاً على ضفاف الكوثر يوم القيامه وأن نجتمع سوياً في جنات الخلد , اللهم آمين
              </p>
              <h2 className="w-full text-2xl text-text_color text-justify ">البرنامج العلمي لموقع طالب علم شرعي</h2>
              <h3 className="w-full text-lg text-text_color text-justify ">


                #مشروع_إعداد_الفقيه.


                قال رسول الله صلى الله عليه:

                (من يرد الله به خيراً يفقهه في الدين).


                هذا برنامج علمي مقترح لدراسة الفقه والأصول؛ دراسة (منهجية) متدرجة..

                ..



                المرحلة التمهيدية:


                - ( *فروع الفقه* )

                - ( *قواعد أصول الفقه التي يعلم مها حاله* )

                كلاهما لابن المبرد.

                ...

                المرحلة الأولى:

                - ( *منهج السالكين وتوضيح الفقه في الدين* ) للسعدي

                - ( *أخصر المختصرات* ) لابن بلبان

                - ( *التذكرة في أصول الفقه* ) للحسن بن عبد الغني.

                ....

                المرحلة الثانية:


                - ( *منار السبيل شرح الدليل* ) الشيخ إبراهيم ضويان.

                - ( *مقبول المنقول* ) للإمام ابن عبد الهادي الشهير بابن المبرد.

                ...

                المرحلة الثالثة:


                ( *الروض المربع* ) على زاد المستقنع - منصور البهوتي

                - ( *قواعد الأصول ومعاقد الفصول* ) عبد المؤمن بن عبد الحق البغدادي - شرح عبد الله الفوزان.


                ونسأل الله أن يتم علينا وعليكم رحلتنا في عافية من أمر ديننا ودنيانا.

                ..

                وكلها محاضرات موجودة بشرحي على


                <a href="https://youtube.com/channel/UCrnbVugpE6ZfBGgeaUw_4xQ">قناتي على اليوتيوب</a>

                ...

                ومن انتهى من مدارسة الروض وإتقانه وأراد أن يشرع في قراءة كتب الحنابلة شروحاً وأدلة فليقرأ على الترتيب التالي:


                1- شرح منتهى الإرادات: الشيخ منصور البهوتي.

                2- كشاف القناع عن متن الإقناع: الشيخ منصور البهوتي.

                3- الشرح الكبير على متن المقنع: شمس الدين ابن قدامة.

                مع مداومة مطالعة اختيارات شيخ الإسلام ابن تيمية.

                ثم إدمان القراءة في كتب أحاديث الأحكام عند الحنابلة ومنها:

                1- العمدة الكبرى في أحاديث الأحكام عبد الغني المقدسي (ت: 600)

                2- كفاية المستقنع لأدلة المقنع: لأبي المحاسن جمال الدين المرداوي (ت: 769)

                3- تنقيح التحقيق من أحاديث التعليق: ابن عبد الهادي المقدسي (ت: 744)

                4- المنتقى من أخبار المصطفى مجد الدين ابن تيمية (ت: 652)

                ..

                وكتبه - خالد منصور

                ليلة الخميس الموافق: 8/2/2024

                ..
              </h3>
            </div>
          </div>
        </div>
      </section>
    </>
  )
}
