{
    "id": 11,
    "title": "مناهج الإستدلال عند أهل السنة ",
    "description": "مناهج الإستدلال عند أهل السنة   ",
    "search": " بحث عن موضوع في كتاب مناهج الإستدلال عند أهل السنة ",
    "type": "المادة",
    "author": "  الدكتور مفرح بن سليمان القوسي",
    "publisher": "بشرح الشيخ الدكتور خالد منصور",
    "section": "قضايا فكرية ",
    "year": 2000,
    "audio_count": 41,
    "audio_type": "mp4",
    "sort": "id",
    "download": "https://archive.org/download/1703.Pdf/1703-%20%D8%A7%D9%84%D9%85%D9%86%D9%87%D8%AC%20%D8%A7%D9%84%D8%B3%D9%84%D9%81%D9%8A%20%28%20%D8%AF%D9%83%D8%AA%D9%88%D8%B1%D8%A7%D8%A9%20%29%20%D8%8C%20%D8%AF.%20%D9%85%D9%81%D8%B1%D8%AD%20%D8%A7%D9%84%D9%82%D9%88%D8%B3%D9%8A%20%20%20%20pdf%20%20.pdf",
    "url": "https://www.youtube.com/embed",
    "image": "https://www.noor-book.com/publice/covers_cache_webp/5/3/7/8/b5843686d6378a6ab05eb3ab9ccfff9a.png.webp",
    "data": [
        {
            "id": 1,
            "name": "مناهج الاستدلال عند أهل السنة 01 كتاب المنهج السلفى د / مفرح القوسى ص 07 شرح الشيخ خالد منصور",
            "url": "EzH2rcvAmNM"
        },
        {
            "id": 2,
            "name": "مناهج الاستدلال عند أهل السنة 02 كتاب المنهج السلفى د  مفرح القوسى ص 14 شرح الشيخ خالد منصور",
            "url": "xjo7NfiStQw"
        },
        {
            "id": 3,
            "name": "مناهج الاستدلال عند أهل السنة 03 كتاب المنهج السلفى د  مفرح القوسى ص 35 شرح الشيخ خالد منصور",
            "url": "BLYJ_9nGLkc"
        },
        {
            "id": 4,
            "name": "مناهج الاستدلال عند أهل السنة 04 كتاب المنهج السلفى د  مفرح القوسى ص 46 شرح الشيخ خالد منصور",
            "url": "1C3NWtLJrMw"
        },
        {
            "id": 5,
            "name": "مناهج الاستدلال عند أهل السنة 05 كتاب المنهج السلفى د  مفرح القوسى ص 63 شرح الشيخ خالد منصور",
            "url": "KI48Ihzneio"
        },
        {
            "id": 6,
            "name": "مناهج الاستدلال عند أهل السنة 06 كتاب المنهج السلفى د  مفرح القوسى ص 77 شرح الشيخ خالد منصور",
            "url": "yfm3DyXHwMg"
        },
        {
            "id": 7,
            "name": "مناهج الاستدلال عند أهل السنة 07 كتاب المنهج السلفى د  مفرح القوسى ص 90 شرح الشيخ خالد منصور",
            "url": "eikSsK9mF8Q"
        },
        {
            "id": 8,
            "name": "مناهج الاستدلال عند أهل السنة 08 كتاب المنهج السلفى د  مفرح القوسى ص 97 شرح الشيخ خالد منصور",
            "url": "PGZE9y4aIMc"
        },
        {
            "id": 9,
            "name": "مناهج الاستدلال عند أهل السنة 09 كتاب المنهج السلفى د  مفرح القوسى ص 105 شرح الشيخ خالد منصور",
            "url": "6Gqs11nBZ_g"
        },
        {
            "id": 10,
            "name": "مناهج الاستدلال عند أهل السنة 10 كتاب المنهج السلفى د  مفرح القوسى ص 107 شرح الشيخ خالد منصور",
            "url": "pdulxsI98lM"
        },
        {
            "id": 11,
            "name": "مناهج الاستدلال عند أهل السنة 11 كتاب المنهج السلفى د  مفرح القوسى ص 111 شرح الشيخ خالد منصور",
            "url": "u7HUZROSOGY"
        },
        {
            "id": 12,
            "name": "مناهج الاستدلال عند أهل السنة 12 كتاب المنهج السلفى د  مفرح القوسى ص 124 شرح الشيخ خالد منصور",
            "url": "SFGOed_1OMo"
        },
        {
            "id": 13,
            "name": "مناهج الاستدلال عند أهل السنة 13 كتاب المنهج السلفى د مفرح القوسى ص 143 شرح الشيخ خالد منصور",
            "url": "wipriDCPaNQ"
        },
        {
            "id": 14,
            "name": "مناهج الاستدلال عند أهل السنة 14 كتاب المنهج السلفى د مفرح القوسى ص 152 شرح الشيخ خالد منصور",
            "url": "i0lXU3TVQxM"
        },
        {
            "id": 15,
            "name": "مناهج الاستدلال عند أهل السنة 15 كتاب المنهج السلفى د مفرح القوسى ص 162 شرح الشيخ خالد منصور",
            "url": "9YXhxAbhj4M"
        },
        {
            "id": 16,
            "name": "مناهج الاستدلال عند أهل السنة 16 كتاب المنهج السلفى د مفرح القوسى ص 173 شرح الشيخ خالد منصور",
            "url": "dsiS_ZLG_R8"
        },
        {
            "id": 17,
            "name": "مناهج الاستدلال عند أهل السنة 17 كتاب المنهج السلفى د مفرح القوسى ص 184 شرح الشيخ خالد منصور",
            "url": "sfb71gGkmOo"
        },
        {
            "id": 18,
            "name": "مناهج الاستدلال عند أهل السنة 18 كتاب المنهج السلفى د مفرح القوسى ص 190 شرح الشيخ خالد منصور",
            "url": "-zreO9Z_ldU"
        },
        {
            "id": 19,
            "name": "مناهج الاستدلال عند أهل السنة 19 كتاب المنهج السلفى د مفرح القوسى ص 207 شرح الشيخ خالد منصور",
            "url": "gxRkgpNQYuk"
        },
        {
            "id": 20,
            "name": "مناهج الاستدلال عند أهل السنة 20 كتاب المنهج السلفى د مفرح القوسى ص 219 شرح الشيخ خالد منصور",
            "url": "KIDMaATc8uc"
        },
        {
            "id": 21,
            "name": "مناهج الاستدلال عند أهل السنة 21 كتاب المنهج السلفى د  مفرح القوسى ص 238 شرح الشيخ خالد منصور",
            "url": "YtuW3EsKPHI"
        },
        {
            "id": 22,
            "name": "مناهج الاستدلال عند أهل السنة 22 كتاب المنهج السلفى د  مفرح القوسى ص 250 شرح الشيخ خالد منصور",
            "url": "EjRvhoP2Isc"
        },
        {
            "id": 23,
            "name": "مناهج الاستدلال عند أهل السنة 23 كتاب المنهج السلفى د  مفرح القوسى ص 268 شرح الشيخ خالد منصور",
            "url": "lM4fo5OKWvU"
        },
        {
            "id": 24,
            "name": "مناهج الاستدلال عند أهل السنة 24 كتاب معالم اصول الفقه د    الجيزانى 01 ص 99 شرح الشيخ خالد منصور",
            "url": "XsSdeBvDeyw"
        },
        {
            "id": 25,
            "name": "مناهج الاستدلال عند أهل السنة 25 كتاب معالم اصول الفقه د    الجيزانى 02 ص 117 شرح الشيخ خالد منصور",
            "url": "Qq1e6PtCYrg"
        },
        {
            "id": 26,
            "name": "مناهج الاستدلال عند أهل السنة 26 كتاب معالم اصول الفقه د .. الجيزانى (03) ص 136 شرح الشيخ خالد منصور",
            "url": "xr8q5aV-NlU"
        },
        {
            "id": 27,
            "name": "مناهج الاستدلال عند أهل السنة 27 كتاب معالم اصول الفقه د .. الجيزانى (04) ص 145 شرح الشيخ خالد منصور",
            "url": "2Fj-PUPaUR8"
        },
        {
            "id": 28,
            "name": "مناهج الاستدلال عند أهل السنة 28 كتاب معالم اصول الفقه د .. الجيزانى (05) ص 155 شرح الشيخ خالد منصور",
            "url": "DTHNCUFT1y8"
        },
        {
            "id": 29,
            "name": "مناهج الاستدلال عند أهل السنة 29 كتاب معالم اصول الفقه د .. الجيزانى (06) ص 168 شرح الشيخ خالد منصور",
            "url": "61bhROcEZxY"
        },
        {
            "id": 30,
            "name": "مناهج الاستدلال عند أهل السنة 30 كتاب معالم اصول الفقه د .. الجيزانى (07) ص 179 شرح الشيخ خالد منصور",
            "url": "O4i1N-27tSQ"
        },
        {
            "id": 31,
            "name": "مناهج الاستدلال عند أهل السنة 31 كتاب معالم اصول الفقه د .. الجيزانى (08) ص 187 شرح الشيخ خالد منصور",
            "url": "EaxI2fM-C_4"
        },
        {
            "id": 32,
            "name": "مناهج الاستدلال عند أهل السنة 32 كتاب معالم اصول الفقه د .. الجيزانى (09) ص 207 شرح الشيخ خالد منصور",
            "url": "KuVi6ad4JYo"
        },
        {
            "id": 33,
            "name": "مناهج الاستدلال عند أهل السنة 33 كتاب معالم اصول الفقه د    الجيزانى 10 ص 215 شرح الشيخ خالد منصور",
            "url": "IMz0MlkTOlQ"
        },
        {
            "id": 34,
            "name": "مناهج الاستدلال عند أهل السنة 34 كتاب المنهج السلفى د  مفرح القوسى ص 353 شرح الشيخ خالد منصور",
            "url": "W6WqB0_mm3s"
        },
        {
            "id": 35,
            "name": "مناهج الاستدلال عند أهل السنة 35 كتاب المنهج السلفى د  مفرح القوسى ص 365 شرح الشيخ خالد منصور",
            "url": "nexylzmduO0"
        },
        {
            "id": 36,
            "name": "مناهج الاستدلال عند أهل السنة 36 كتاب المنهج السلفى د  مفرح القوسى ص 375 شرح الشيخ خالد منصور",
            "url": "YXAPn8l24rQ"
        },
        {
            "id": 37,
            "name": "مناهج الاستدلال عند أهل السنة 37 كتاب المنهج السلفى د  مفرح القوسى ص 383 شرح الشيخ خالد منصور",
            "url": "DdDGeh6Is0k"
        },
        {
            "id": 38,
            "name": "مناهج الاستدلال عند أهل السنة 38 كتاب المنهج السلفى د  مفرح القوسى ص 388 شرح الشيخ خالد منصور",
            "url": "TgAyDocCYHQ"
        },
        {
            "id": 39,
            "name": "مناهج الاستدلال عند أهل السنة 39 كتاب المنهج السلفى د  مفرح القوسى ص 392 شرح الشيخ خالد منصور",
            "url": "M410yU6X41g"
        },
        {
            "id": 40,
            "name": "مناهج الاستدلال عند أهل السنة 40 كتاب المنهج السلفى د  مفرح القوسى ص 405 شرح الشيخ خالد منصور",
            "url": "-sl6gO_RMME"
        },
        {
            "id": 41,
            "name": "مناهج الاستدلال عند أهل السنة 41 كتاب المنهج السلفى د  مفرح القوسى ص 410 شرح الشيخ خالد منصور",
            "url": "XmdcZaar5rY"
        }
    ]
}