import React from "react";
import FullTitle from "@/Utils/FullTitle";
import * as icon from "@/Components/Icons/icons";
import BookInfo from "./BookInfo";
import { Chapter } from "@/Interfaces/InterFaces";
import BookSoundPage from "@/Components/Books/BookSoundPage";


export default function BookContainer({ Book }: { Book: Chapter }) {
  return (
    <>
      <div className="w-full h-full">
        {
          Book.title !== null && Book?.title !== undefined ? (
            <>
              <FullTitle F_Title={Book?.description} />
              <BookInfo Book={Book} />
              <BookSoundPage Book={Book} />
            </>
          )
            :
            (
              <>
                <div className='w-full flex flex-col  h-screen justify-center gap-2 items-center'>
                  {/* <h1 className="text-red-800 text-2xl font-bold">مختصر لمشروع برنامجنا العلمى</h1> 
              <p className="text-justify px-3 h-[600px] overflow-y-scroll scrollbar-hide text-xl font-bold text-gray-900">

1 - من هو طالب العلم الذى ينتظر ؟

** الذي نؤمل بعد ذلك أن يكون طالبا ربانيا يعتمد عليه في المهمات و الملمات 

صاحب ثبات و سوخ عند الفتن لمعرفته بضوابط الحلال و الحرام 

و له إسهام مؤثر  التعريف برب العالمين و سنة النبي سيد المرسلين .


...


        (فائدة جلى ) <br />

2 - لا تهتم بكثرة المعلومات بقدر ما تهتم بأن لا يدخل العقل إلا صورة صحيحة للعلم 

أما كثرة المسائل الفير منضبطة في الذهن .. 

فليست تعد من العلم النافع 
<br />
فعلينا أن نهتم جيدا بما يلي :-
<br />
• صورة المسألة
<br />
• دليل المسألة 
<br />
• موضع الدلالة من الدليل
<br />
• وجه الدلالة من الدليل

<br />
( و الذي يجمع لنا ذلك كله ) :
<br />
* الاهتمام باللغة العربية 
<br />
* الاهتمام بمصطلحات العلماء
<br />
...

تنبيه :
<br />
 
هناك إشكاليات تعرقل مسيرة الطلب ..

<br />
* إشكالية الطالب نفسه
<br />
* إشكالية البداية بلا خطة
<br />

و لحل هذا الاشكال : 
<br />
لابد من وضع خطة 

علمية - زمنية - مادية .

نقيس بها القدرات  . 
و نضبط بها سيرنا مع هذا البرنامج العلمي


<br />
** إشكالية اختيار الكتاب .. 
و الانتقال قبل الإتقان

أو ( الطريقة البرغوثية )

و الحل باختصار أن نعلم : 

أن نعلم أن طعام الكبار سم الصغار ..

فالربانية الحقة ؛ أن نتربى على صغار العلم قبل كباره

.....
<br />

     ( خطة البرنامج العلمى ) 


تقسم العلوم إلي قسمين :
<br />
1 - القسم الأول :

 علوم تأسيسية لابد من داستها و الاختبار فيها عن طريق الدراسة التحليلية .. و هي 

(  الأصول العشرة  )
<br />
• أصول الاعتقاد 
 <br />
• أصول الفقة
<br />
• أصول التفسير
<br />
• أصول المصطلح 
<br />
• أصول اللغة
<br />
• أصول الدعوة
<br />
• أصول الديانات الباطلة 
<br />
• أصول اهل البدع
<br />
• أصول القواعد الفقهية
<br />
* مقاصد الشريعة 
<br />


2 - القسم الثاني :
<br />
( علوم تثقيفية شرعية )

جل تحميل الطالب فيها ..
علي القراءة و المذاكرة الفردية
<br />
* كالتفسير 
<br />
* شروح السنة 
<br />
* التاريخ الإسلامي
<br />
* السير و التراجم
<br />
* الأداب و الرقاق 
<br />
...

كيف تنظم وقتك ؟؟

الوقت المناسب لبناء شخصية الطالب المجتهد ..
<br />
* طالب علم مبتدئ - 3 ساعات يوميا
<br />
* طالب علم متوسط - 5 ساعات يوميا ..
<br />
* طالب علم متفرغ - من 7 / 10 ساعات يوميا 
<br />
..

<br />
( الطريقة المعتمدة للدراسة و القراءة ) :- 
<br />
* نسمع الشرح جيدا مع المتابعة في الكتاب 
<br />
* فهم المسائل جيدا 
<br />
* حفظ دليل واحد علي الأقل لكل مسألة .
<br />
* كتابة الزيادات المهمة التى يزيدها الشارح و لا توجد في الكتاب .
<br />
* معرفة المسائل التى خالف فيها الشارح المألف و كتابتها في الكتاب .
<br />
* تقسيم الدرس الي عدة عناصر يسهل مراجعتها
<br />

** طريقة القراءة :- 
<br />
( طريقة الفوائد و المسائل )
<br />

الفوائد : 

أن نقرأ الكتاب ثم تقوم بتسجيل كل فائدة جديدة تمر بنا ..

ثم نقوم بتصنيف هذه الفوائد فيما بعد حسب موضوعاتها 

فائدة فقهية - فائدة حديثية - فائدة لغوية - فائدة أصولية ... و هكذا 

<br />
المسائل : 

كل مسألة لا نفهمها أثناء القراءة علينا أن تكتبها ..

- و نحدد ما أشكل علينا فيها ..

 و نجتهد في سؤال من نثق بهم من أهل العلم ..

              </p> */}
                  <icon.SiAudiobookshelf className="text-blue-700 text-3xl  mx-1 " />
                  <h1 className='text-center flex justify-center items-center text-3xl text-accent_color'>قم باختيار كتاب من القائمة الجانبية للإستماع إليه
                  </h1>
                  <h3 className='text-center w-full md:w-[50%] lg:w-[50%] my-2 flex justify-center items-center text-fuchsia-700'>روى الإمام البخاري (71)، ومسلم (1037)  عن مُعَاوِيَةَ بن أبي سفيان رضي الله عنهما قال: سَمِعْتُ النَّبِيَّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَقُولُ: مَنْ يُرِدِ اللَّهُ بِهِ خَيْرًا يُفَقِّهْهُ فِي الدِّينِ.</h3>
                </div>
              </>
            )
        }
      </div>
    </>
  )
}
