{
    "id": 4,
    "title": "فروع الفقه لإبن المبرد",
    "description": "فروع الفقه لإبن المبرد وتوضيح الفقه في الدين",
    "search": "بحث عن مادة في كتاب فروع الفقه لإبن المبرد",
    "type": "المادة",
    "author": "إبن المبرد",
    "publisher": " بشرح / الشيخ د. خالد منصور",
    "section": "فقه حنبلي",
    "year": 2002,
    "audio_count": 24,
    "audio_type": "mp4",
    "sort": "id",
    "download": "https://archive.org/download/sharh_kitab_furu3_al-fiqh/kitab_furu3_al-fiqh.pdf",
    "url": "https://www.youtube.com/embed",
    "image": "https://www.noor-book.com/publice/covers_cache_webp/2/b/3/6/d0ed35f604b368e5a66ea3d1de64d8b9.png.webp",
    "data": [
        {
            "id": 1,
            "name": "كِتَابُ فُروعِ الفِقْه لابْنِ المَبْرَد شَرْحُ فَضِيلَة الشِّيخ خَالِد مَنْصُور 01 مُقدّمَة الكِتَاب",
            "url": "aZS4V1WK6-o"
        },
        {
            "id": 2,
            "name": "كِتَابُ فُروعِ الفِقْه لابْنِ المَبْرَد شَرحُ فَضِيلة الشّيخ خَالِد مَنْصُور 02 المَسحُ عَلى الخُفين",
            "url": "8Fso_N8YS2A"
        },
        {
            "id": 3,
            "name": "كِتَابُ فُروعِ الفِقْه لابْنِ المَبْرَد شَرحُ فَضِيلة الشّيخ خَالِد مَنْصُور 03 التَيمُم",
            "url": "VHsv7LYc66E"
        },
        {
            "id": 4,
            "name": "كِتَابُ فُروعِ الفِقْه لابْنِ المَبْرَد شَرحُ فَضِيلة الشّيخ خَالِد مَنْصُور 04 وَاجِبَات الصَّلَاة",
            "url": "fB_e-0e-pUY"
        },
        {
            "id": 5,
            "name": "كِتَابُ فُروعِ الفِقْه لابْنِ المَبْرَد شَرحُ فَضِيلة الشّيخ خَالِد مَنْصُور 05 المُسْتَحَبَّات",
            "url": "ffVM-evwMKQ"
        },
        {
            "id": 6,
            "name": "كِتَابُ فُروعِ الفِقْه لابْنِ المَبْرَد شَرحُ فَضِيلة الشّيخ خَالِد مَنْصُور 06 أَقْسَامُ الصَّلَاة",
            "url": "TInaiQnD3g8"
        },
        {
            "id": 7,
            "name": "كِتَابُ فُروعِ الفِقْه لابْنِ المَبْرَد شَرحُ فَضِيلة الشّيخ خَالِد مَنْصُور 07 أَحْكامُ الجُمْعَة",
            "url": "vWCBNH3R9mA"
        },
        {
            "id": 8,
            "name": "كِتَابُ فُروعِ الفِقْه لابْنِ المَبْرَد شَرحُ فَضِيلة الشّيخ خَالِد مَنْصُور 08 صَلاةُ اهل الأَعذَار",
            "url": "WsjIyV_Ipxc"
        },
        {
            "id": 9,
            "name": "كِتَابُ فُروعِ الفِقْه لابْنِ المَبْرَد شَرحُ فَضِيلة الشّيخ خَالِد مَنْصُور 09 كِتَابُ الزَّكَاة",
            "url": "G2O46Ll_bQw"
        },
        {
            "id": 10,
            "name": "كِتَابُ فُروعِ الفِقْه لابْنِ المَبْرَد شَرحُ فَضِيلة الشّيخ خَالِد مَنْصُور 10 كِتَابُ الصيَام",
            "url": "XqDeAFgyw-Q"
        },
        {
            "id": 11,
            "name": "كِتَابُ فُروعِ الفِقْه لابْنِ المَبْرَد شَرحُ فَضِيلة الشّيخ خَالِد مَنْصُور 11 كِتَابُ الحَج",
            "url": "mrYPUvckTc4"
        },
        {
            "id": 12,
            "name": "كِتَابُ فُروعِ الفِقْه لابْنِ المَبْرَد شَرحُ فَضِيلة الشّيخ خَالِد مَنْصُور 12 تَابِع كِتَابُ الحَج",
            "url": "kdbCucBw1Y0"
        },
        {
            "id": 13,
            "name": "كِتَابُ فُروعِ الفِقْه لابْنِ المَبْرَد شَرحُ فَضِيلة الشّيخ خَالِد مَنْصُور 13 تَابِع كِتَابُ الحَج",
            "url": "lG3em8e8EKw"
        },
        {
            "id": 14,
            "name": "كِتَابُ فُروعِ الفِقْه لابْنِ المَبْرَد شَرحُ فَضِيلة الشّيخ خَالِد مَنْصُور 14 كِتَابُ المُعَامَلات",
            "url": "CuNLKpAovc0"
        },
        {
            "id": 15,
            "name": "كِتَابُ فُروعِ الفِقْه لابْنِ المَبْرَد شَرحُ فَضِيلة الشّيخ خَالِد مَنْصُور 15 الــرِّبــَا",
            "url": "ERIBhid2wcE"
        },
        {
            "id": 16,
            "name": "كِتَابُ فُروعِ الفقْه لابْنِ المَبرَد شَرحُ فَضِيلة الشّيخ خَالِد مَنْصُور 16 الوثَائِق عَلى الحُقوق",
            "url": "fT6iAIt9nZI"
        },
        {
            "id": 17,
            "name": "كِتَابُ فُروعِ الفِقْه لابْنِ المَبْرَد شَرحُ فَضِيلة الشّيخ خَالِد مَنْصُور 17 تَابِع المُعَامَلَات",
            "url": "3BNxcEK0i8M"
        },
        {
            "id": 18,
            "name": "كِتَابُ فُروعِ الفِقْه لابْنِ المَبْرَد شَرحُ فَضِيلة الشّيخ خَالِد مَنْصُور 18 تَابِع المُعَامَلَات",
            "url": "ShkLxniKsT0"
        },
        {
            "id": 19,
            "name": "كِتابُ فُروعِ الفِقْه لابْنِ المَبرَد شَرحُ فَضِيلة الشّيخ خَالد مَنْصُور 19 الاجتِمَاعُ و الافتِراق",
            "url": "eH1-_yoD4bo"
        },
        {
            "id": 20,
            "name": "كِتابُ فُروعِ الفِقْه لابْنِ المَبرَد شَرحُ فَضِيلة الشّيخ خَالد مَنْصُور 20 الاجتِمَاعُ و الافتِراق",
            "url": "aURZ1Qk1zzk"
        },
        {
            "id": 21,
            "name": "كِتابُ فُروعِ الفِقْه لابْنِ المَبرَد شَرحُ فَضِيلة الشّيخ خَالد مَنْصُور 21 الاجتِمَاعُ و الافتِراق",
            "url": "keWP-qYoBzE"
        },
        {
            "id": 22,
            "name": "كِتابُ فُروعِ الفِقْه لابْنِ المَبرَد شَرحُ فَضِيلة الشّيخ خَالد مَنْصُور 22 كِتَاب الجِنَايَات",
            "url": "nGwU8V5X7kI"
        },
        {
            "id": 23,
            "name": "كِتابُ فُروعِ الفِقه لابْنِ المَبرَد شَرحُ فَضِيلة الشّيخ خَالد مَنْصُور 23 تابِع كِتَاب الجِنَايَات",
            "url": "nl4xjL6lsvk"
        },
        {
            "id": 24,
            "name": "كِتابُ فُروعِ الفِقه لابْنِ المَبرَد شَرحُ فَضِيلة الشّيخ خَالد مَنْصُور 24 كِتَاب المَوَاريِث",
            "url": "ApQV55VEd64"
        }
    ]
}